{"wWwr0tDSqnE": {"video_id": "wWwr0tDSqnE", "title": "Demo: Hello World | Python for Beginners [6 of 44]", "transcript": ">> So, Christopher has\nshown you how to get Visual Studio Code working\nwith the Python extension, now let's go into\nVisual Studio Code and actually start trying\nout some of our code. Now, when you work inside\nVisual Studio Code, you're going to need to create\na folder on your file system first, and that's a place where you can keep all your files together\nthat you're working on. So I've already gone ahead\nand I've created a folder. So as soon as I open\nup Visual Studio Code, I'm going to want to\ngo to \"File,\" \"Open folder,\" and open up that folder\nthat I've precreated. So I've already created a folder called Intro to\nPython development, I'm going to open that folder now, and now that gives me a place to store all the files I'm\ngoing to be working on. Once I've got that folder\nopen and I can see the folder name listed\nover here on the left, then I can say \"New file\" to create a new Python file\ninside that folder. So now, I can try out\nthat print statement. So we say, ''Print, Hello world.\" Now, initially, there's no way that Visual Studio Code can tell that what I've written is a Python module. So it's when I save the file that I tell Visual\nStudio it's Python. So I'll just save it\nby going to ''File,\" \"Save,\" or Control S if you\nlike keyboard shortcuts, and once it's saved, I'm going to make sure I\ncall it Helloworld.py, and that PY extension is a cue to Visual Studio Code that I've\njust created a Python script. You'll see right away\nsome colors appearing. That's a good sign because\nit's actually using code highlighting to indicate that the hello world is the string\nby showing up in red and so on. So I can tell now that Visual Studio Code recognizes\nthis as a Python script. Then I want to run that. So to run that code, and this will be\nyour ultimate test of whether you got all your Python\ninstalled correctly, you just type \"Python\" and\nthen the name of your script, and I called mine Helloworld.py. If you forget your file name, don't worry, it's at\nthe top of the tab, and then you hit \"Return\"\nand sure enough, there's Hello world\ndisplayed on the screen. So I've successfully run\nmy first script in Python. As I mentioned, you can put single quotes or double quotes\naround your string. I'm just going to use Control S\nto save that file again, go back to \"Command\nline,\" I'm going to use the up arrow which allows me to\ngo to the previously run command, and rerun my script, but this time with double quotes\naround the string, and sure enough, still\ndisplays Hello world. So as I mentioned, single quotes, double quotes, either\none will work just fine. Now what if I want\nsomeone to input a value? Well, I could create\na variable called Name, and say \"Input, what is your name?\" Then I can say hello, and then maybe after I say hello, I say let's print\nthe name on the screen. So let's say hello to the person\nwho has typed in their name. So now, save that. Go to my code, rerun that, and it says, \"What is my name?\" My name is Susan, and now I see \"Hello Susan\"\nappearing in the output. So the input command I said is a way for me to ask\nfor input from a user, and then I can take that input and store it back inside a variable. Once you start having multiple lines of output displaying on the screen, you may want those blank lines. So at anytime you can do\nsomething like \"Print, hello,\" and then I\ncan just say \"Print, world,\" and you will notice\nthose appear on different lines, so you can see hello world\nappear in different lines. I'm going to show you\nanother useful little command in Visual Studio Code here, we're starting to get to the bottom\nof the command line output. So it just typing the word\n\"CLS,\" we'll clear the screen and take us back to\nthe top of this output here. Useful little thing when you've got a lot of outputs\ndisplaying on the screen. Another way of putting output over multiple lines\nis you can use that slash n. Slash n is\nan escape character that means, please insert a new line. So that will also display a line\nof code over two lines of output. So slash n is a way of saying\nnew line, right inside a string. This is really handy when used when displaying output to use\non a console application, but as I mentioned,\nprint is also very popular for coders trying\nto debug their code. So if I was writing some code\nthat was doing some math, x equals 532 plus 12, and then I say y\nequals x divided by 0, now I know that dividing by 0\nis going to cause an error, and then I say \"Print, yay I did math.\" So I write a very simple\nlittle program here, and I save it, and I go down, and I run that program, and it blows up. Now, I'm using\na very simplified example. You can probably look at my code and guess which line\nof code blowed up. It's the divide by 0. But what if this was inside a 500, 600 line program with\nmultiple modules and functions, sometimes it'd be trough to track down where that line is blowing up, even though in the error message it does give you a line number\nwhich gives you a hint. So sometimes when I'm\ntrying to debug my code, I will literally write things like saying ''Adding numbers,'' sorry, promised I would use\nsingle quotes here, 'Adding numbers', and\nthen I add my numbers, and then I'll say print, 'dividing numbers,' and then\nI will divide the numbers, and then I have\nmy print statement saying, 'Yey I did math.' That way, when I go\nand I run my code, you can see that the adding\nnumbers message appeared, the dividing numbers\nmessage appeared, and then I got an error message. So it can help me flow back through my code to figure out\nwhat code executed successfully, and whichever print statement\nI didn't see is probably the one right\nafter the line that failed. So don't be afraid to use print\nstatements as a debugging tool, as you're learning to code."}, "JA3sCmrv11M": {"video_id": "JA3sCmrv11M", "title": "Introduction to semiconductors", "transcript": "Welcome everyone my name is Digbijoy. And today we shall begin this new course Fundamentals\nof Semiconductor Devices. It will be a 30 hour long course. I will be recording lectures for you; I will\nbe taking this course. Many of you might have read about or studied\nabout semiconductor devices, but this course will be a little bit different in the sense\nthat we shall try to correlate semiconductor devices with practical real life applications. We will make it less mathematical, I mean\nthey has to be mathematics, but it will not be very complicated course. We will try to make sure that there is no\nprerequisite. So, even if you have passed your 12th board\nexams, you should be able to understand the concept of this course with the basic that\nyou have learned. It will also have elements for people who\nare doing post graduate or PhD, there will be sufficient concepts for thoughts, but the\nidea of this course is to train you and train you to learn how to analyze and understand\nsemiconductor devices, because it is a very important aspect or branch of electronics,\nphysics, material science and so on. In many institutes of this country, semiconductor\ncourses are thought, but you know the practical correlation with devices and many of the fundamentals\nare probably not in covered in very great details. So, we will try to do that here ok. Now, today is the first introductory class,\nfor so 1 hour we shall discuss about what is semiconductor, where are semiconductors\nused, what are the types of semiconductor and introduced very basic concepts of semiconductor\nbands ok. Even if you have not heard about these words\nlike bands and band diagram, you should not be worried. We shall go very slow, we make sure that you\nunderstand each and everything that we discuss here ok. So, semiconductor devices are everywhere the\nvery reason you are able to see me and I am able to talk to you is because use of semiconductor\ndevices. You are very well aware that all our cell\nphones, mobiles, laptop, ThinkPad’s, everything we have processors, memory devices, logic\ndevices, they are all made of semiconductor devices by the way right. So, the transistor which revolutionized our\nelectronics industry that transistor is one of the most important semiconductor devices\nthat was invented and that has eventually triggered the IC revolution, the integrated\ncircuit revolution. In the last 50-60 years you are very aware\nthat the integrated circuit revolution has accelerated the progress of mankind faster\nthan probably anywhere else in the history ok. It is incredible the things that are shaping\nup and you may not be aware that semiconductor devices are used in. So, many other applications outside of mobile\ncell phones and laptops just so many other applications which you may not be aware ok. For example, your electric vehicles that are\nstarting to populate the roads increasingly, you know there are semiconductor devices to\nenable charging of these vehicles. You have to convert power; you have to convert\npower from say kilowatt to watt or watt to kilowatt ok. All your high speed application like radars\nand satellite transmission communication also need transistors that can operate at very\nhigh speed and very high power. You know semiconductor devices are also used\nfor optical devices. All the white light LEDs that you are using\nnow to light up, the street, the stadiums, the houses everything that white light LED\nis a semiconductor device. Solar cells are semiconductors. Photo detectors and photo sensors are also\nsemiconductors mostly. There are varieties of semiconductor devices\nthat are revolutionizing our lives ok. So, it is very important for us to understand\nhow the semiconductor devices work, what is semiconductor and so on. You might know of course, semiconductor is\nsomething that has a conductivity between metal and insulator, but that is not enough,\nwe shall go more deeper into the concepts of semiconductor ok. So, I will start using white board or writing\ninstead of slides, so that we can actually get the ideal very closely. So, the word semiconductor and you know I\nwill use different color maybe semiconductor ok. Conductor is what conducts electricity very\nwell like metals right; and insulators are like wood and glass which cannot carry electricity\nso much. But the word semi conductor this word semiconductor\nmeans those materials whose conductivity can be tuned or tailored you know that probably\nmost of you know. You see if you have a piece of metal it is\nvery difficult to change the conductivity, I mean you can raise the temperature that\nis different, but at room temperature for example, if you shine light or do anything\nelse, it is very difficult to change the conductivity. Or if you take a piece of glass for example,\nit will not conduct electricity no matter what you do, it is very difficult right. So, there are these materials call semiconductors\nwhere you can change the conductivity. All of you know what is conductivity? You know resistance right, resistance follows\nthe ohms law typically V by I. So, conductivity is sort of the reciprocal\nof resistance or resistivity. So, you know how much current a material can\nconduct is a measure that connectivity measures that quantity. And semiconductors that is unique materials\nwhose conductivity can be tuned by many many orders of magnitude and that is there beauty. Because of that property you can make devices\nthat can cater to your needs ok. You can use semiconductor as a switch, you\ncan use it as a switch electrical switch ok. You can use it as an amplifier. What does a switch do? A switch will basically it will it will have\nan on state. So, it will let current go in some condition;\nit is a off state, so it will block the voltage and not allow current to go in another state,\nthat unique property cannot be there in metal. You cannot make metal go into off state. A metal will not be able to block voltage\nright. If you apply 100 volt or 200 volt and you\nexpect you know pico amps of current, it will not happen right. Or a glass you cannot expect a very high current\nampere or milli ampere to flow at very low voltage, it will break down at very high voltage\nby the way. So, only semiconductors have that unique property\nthat it can both allow very high current to flow, it can also block very large voltages\nlike insulators, so that is the beauty of semiconductor that we can use as a switch. And that has so many applications you know\nthat has so many applications that I will come. Then you can use it is an amplifier. What amplifier does is that? It amplifies, it enlarges the signal ok, and\nthat has a gain; and that gain can be used in many RF devices for example, right. It can be used as a logic device right. As a logic device your CMOS logic as a memory\ndevice, you can use it is as for memory right where to store information, there are so many\nthings you see. You can use it as an LED that emits light. You can also use it as a laser diode right\nin a laser pointer for example, and so many other uses. It you can use it as a solar cell; you can\nuse it is a photo detector; all these devices are actually influencing and revolutionizing\nour lives. And these are enabling the larger industry\nthe electronic industry for example is heavily dependent semiconductor devices right. So, this course will be basically understanding\nhow does different devices work. And what is what are the basics of semiconductor\nand will never lose side of two things one is that the concepts have to be simple so\nthat we all understand what we are talking about. The concepts have to be simple and explain\nwith, the second point is that they have to we have to explain all the concepts with practical\nexamples and you know practical correlations so that we know with the world that we are\nliving in how this devices relate ok that is very important. So, this is broadly the outline of the course. We have different themes, different topics\nwithin semiconductors that we will cover right, many devices that we will cover and basics\nof semiconductor that we will cover here. So, let me change the pages. So, we will have 30 lectures. So, today is the first lecture right. We will have 31 hour lectures. And we shall we shall study devices, the second\nyou know the broadly if I split the course into 2 halfs. And here I will the first half of this whole\ncourse you know will be basics. So, in basics we will discuss about the basics\nof band, you know there is something call band and band diagram. If we are not familiar with this terms do\nnot worry we shall definitely understand very clearly what band diagrams mean. And you know the moment you understand band\ndiagram, you can understand devices. The Nobel laureate Herbert Kroemer, he got\na Nobel Prize in 2000 for you know developing hetero junction and optoelectronic devices. He says that if you cannot draw band diagram\nfor a semiconductor device, it means that you do not understand semiconductor device. So, the moment you understand band diagram,\nwe can understand semiconductor devices very well ok. And so, we shall introduced the concept of\nelectrons which you know and holes which might be a new concept to you ok. We will introduce concepts of doping. What is doping? Doping is basically the ability that the process\nof changing the conductivity of a material right by introducing some impurities. We will introduce the concept of doping. We will introduce the concept of some statistics\nagain not too much mathematics, but very basics. Why do you need statistics, it is actually\ncall of Fermi-Dirac statistics. Let us not get scared about the word here. The Fermi-Dirac statistics basically is a\ntype of statistics that will help us explain the semiconductor you know how electrons are\nthere in semiconductor, how current flows and so on, so many other things will be discuss\nthere. We will also discuss about transport, the\ncurrent transport in semiconductor, eventually semiconductor devices have to carry current. All the processors and logic devices in your\ncell phones or laptops, they have to carry current, small current in their circuits. So, how do current flow, that transport we\nshall discuss. There are different ways of transport in you\nknow way in the current transport happen. And also that depends on something called\nhow carriers recombine they something called carrier recombination. We should not worry so much about it right\nnow. But how carriers will recombine, we will discuss\nthat right. And we shall introduce the most common thing\nthat we always learn which is p-n junction. I am sure you have heard about or read about\np-n junction in even in your class 12 or 12 standard boards very briefly. So, we shall go to the p-n junction. And pretty much that will be your basics you\nknow there will be some other things I am not writing it down here, but more or less\nthis will be how your basics will come up ok. And the device we shall definitely study MOS\nand MOSFET right. MOSFET devices are the most common devices\nthat are used in electronics. Nowadays of course, there very highly scaled\nok that is a different things. We shall also study about BJT; it is a bipolar\njunction transistor. It is a different type of transistor that\nwe use. And we shall study very briefly about solar\ncell which has to be there, you know our Indian government is spending so much on solar cell. We need to know what, how solar cells work. We will also study about LEDs and photo detectors\nvery briefly one one lectures probably each right. And we shall study about transistors for and\ndiodes for different applications ok, transistors and diodes, how are they engineered, how are\nthey tailored for say high speed applications or maybe for high power applications right,\nor may be for low noise applications right. So, many applications are there may be for\nmemory and logic right. So, how are transistors decided or designed\nor tuned in order to cater to this different needs separately. We shall also go through them ok, and that\nwill be the basically the summary of the course that we have. The many new things that we will come across\nhere, many things that we may not have heard before, but we shall definitely start as if\nwe do not know anything and we will start from there ok, we will start from there. So, the most important thing in semiconductor\ndevices you know I keep telling that semiconductor devices have revolutionized our lives. And our semiconductor devices have evolved\nyou know from if I look at 1948 is when the first transistor probably you know BJT was\ninvented at Bell labs in US it is you know. And from 1948 to 2018 now, sorry 2018 now\nthings have changed immensely. Now, you have hand held Smartphone’s, I\nmean it can do crazy things right. So, this evolution has happened over so many\nyears right. And if you take any chip, if you take any\nchip, there many transistors in a chip that do they work right. The number of transistors in a chip they double,\nthey become two times almost every one and half years ok. The number of transistors in a chip double\nevery roughly every one and half years and that is called Moore’s law, because a person\ncalled Moore have observed this and predicted this long back in 1960s and 70s that you know\nevery two years, the number of transistors is doubling. What is means is that transistors are becoming\nsmaller their shrinking the sizes and that is why we are able to accommodate more and\nmore transistors in the same chip. So, the number of transistors is doubling\nevery one and half years. And secondly, when you can pack more and more\ntransistors in each of this chip, then the complexities and functionalities also become\nlarge. So, you can do more and more sophisticated\nwork a computer in 1980 was not as advanced as in 1995 for example. And in 2004 laptop was sufficiently more advanced. And now in 2018, for example, a Smartphone\nis much more smarter and sophisticated, then a laptop of 1990 or you know 2005 for example. So, this is the evolution of transistor that\nhappened over a large amount of time in over the last 60, 70 years. And transistor is not the only device of course,\nthere are diodes and detectors and so many other things, but transistor is one of the\nmost fundamental building blocks of all our circuits right. And transistor is a semiconductor device that\nwe shall come about. We shall discuss transistor in details, but\nin very brief a transistor is a device where the current flowing between two terminal A\nand B is not decided by the voltage that you applying between A and B, but by the voltage\nyou applying at another point C, so that means, the voltage that you apply at point C can\ncontrol how much current is flowing between A and B. So, it can be used as a switch it\ncan be used as an amplifier and so many other things right that is a transistor in essence. Now, this is evolution of transistor and you\nknow and 2018, the transistor sizes have become so so small that you need super powerful electronic\nmicroscope actually to see them. And you need very advanced nanofabrication\ntechnologies to fabricate such transistors ok. When we you know about the company Intel right,\nIntel is one of the leading companies that make this microprocessors and chips right. And Intel of course, the Samsung and all though\nSamsung has this consumer electronic product like you know cell phones, washing machine\nand TVs and what not, but Samsung also has a lot of you know technologies and facilities\nfor very highly scaled and very sophisticated chip design and transistor technology. So, this company is for example, Intel, Samsung\nand there are many others like global foundery and so on, they report the development of\ntechnology like say 14 nanometer technology or 14 nanometer node they call it. It does not necessarily mean the transistor\nis 14 nanometer, but you can say that you know the smallest feature you know that the\nspacing between two lines adjacent lines could be as small as 14 nanometer. Many things are there we will come to that\nin later classes, but you know 14 nanometer is so small. Can you get a feel of what 14 nanometer is? 14 nanometer is you know 1 nanometer is basically\n1000 times of 1 micron right, 1 micron. And you know 1 micron is basically itself\n1000 times 1000 times smaller than 1 millimeter. So if you take a ruler, you know if you take\na school ruler that you have, you have this 1 millimeters gaps right, 1 millimeter gap. If you divide that 1 millimeter gap into 1\nmillion times right, then you get 1 nanometer. So, it is very, very small, you cannot see\nit with eye ok, so that transistor has evolved from 1948 to 2018. Now, we are talking about such small dimensions\nand so many complex functionalities are there in a cell phone. So, many other areas like you know electric\nvehicles and radars, satellites also used transistors that we shall learn in this course. But so it is high time we start learning how\nsemiconductor devices are realized, and what we need to know in this course ok. So, the most important concept of semiconductor\ndevices or semiconductor is called bands. And these are energy bands actually, these\nare energy bands. Now, what are energy bands actually? Very simplistically speaking if you take any\nsemiconductor you know what are the common examples of semiconductors do you know silicon,\nsilicon is a of course, an element right it is a very the most widely used and the most\ncommonly used semiconductor by the way. You have Germanium that is also another semiconductor\nright. Some forms of Carbon also can be semiconductor\nfor example. These are elemental semiconductor because\nthis is only one material that is Silicon; this is one material that is Germanium. You can also mix two for example, you have\nGallium which is a metal, and then you have arsenic right, and you mix them together right\nand you get gallium arsenide right that is a compound. Its formula is Ga-As gallium arsenide right. This is a compound semiconductor why because\nthere are two two elements are there, this is a compound semiconductor. These are elemental semiconductors right. And all these semiconductors are characterized\nby something called energy bands ok. The moment we understand energy bands, many\nof the things will become clear right. So, in very very simple language, you know\nyou have in any and when you take silicon for example, or germanium or some other materials\nfor example, you have an energy band which is fully filled with electrons. And then there is another band which is empty\nor mildly filled ok, it is empty ok. And there is what is this y-axis? By the way, this is energy actually you know\nenergy; and what is this x-axis by the way this is distance in centimeter or meter. So, I can draw even longer which means it\nis much longer you know I am talking about diode or something. So, it is actually distance. So, I am talking about distance and this is\nenergy. There are bands there are bands one band is\nfully filled, and one band is sort of empty mostly empty or maybe there will be few carriers\nhere ok. Now, when I say fill, they are filled with\nelectrons right. Now, of course, the question that we have\nto ask is what are these bands and where have they come from, you cannot magically say that\nsilicon you know silicon has this bands. Why are these bands coming from? To understand that you have to go to you know\nthe fundamental each atom each element for example, you know that there are this k shell,\nL shell and then electrons that you studied in your high school physics and chemistry\nremember, we have to bring that picture into account to actually explain the bands eventually. So, let us take a much simpler example right. So, let us take for example, carbon you know\ncarbon has how many electrons, its formula is 1s 2 2 s 2 2 p 2 sorry right sorry 2 p\n2. So, it has 6, out of 6 electrons in total\nright. I am sure that you have learned this representation\n1 s 2 2 s 2 2 p 6 is taught in high school and higher secondary you know 10, plus 12,\nplus 12 chemistry and physics I am sure you have learned this and the understanding is\nthat you have you know this representation and that is why we are able to understand\nthis course ok. So, we have to know this we assume that you\nknow this thing, so 1 s 2 2 s 2 2 p 2 that is the representation of carbon. What does it mean? It means that you have this different shells\nknow. So, in 1 =s you know 2 electron right, you\nhave 2 electron. Then in 2s, you have 2 more electron right;\nand then 2p you have two more electron. Now, you know in 1s there are only 2 states\navailable and both are occupied by electron. In 2 states, there are 2 states in 2s, and\nboth are occupied by electron. In 2p, there are 6 states available. If you remember p or del can accommodate 6\nstates, 6 electrons, but there are only two available here ok. So, there are something that is empty ok,\nthat is for one single carbon atom right, one single carbon atom. What are we trying to do; we are trying to\nunderstand how these bands form. I told you right in semiconductor we talk\nabout some bands one when is fully filled of electrons and one band is empty. There is an energy difference between these\ntwo ok. And once we understand this concept we basically\nmove ahead we understand the semiconductor devices or concepts. So, where are these bands coming from that\nis what we are trying to understand, let us not lose track of our site. So, we want to understand how. This is only one single carbon atom, but do\nyou think a semiconductor has only one single atom, no. A semiconductor has the trillions and trillions\nof Avogadro’s numbers of atoms right, I mean it is not one single atom. So, you have one carbon atom for example,\none isolated carbon atom, you get this picture. There is another isolated carbon atom very\nfar away, you get this picture. There is another isolated carbon atom very\nfar away you get this picture and so on and so forth right. In three-dimensional, you can have lot of\ncarbon atoms they are very far from each other. So, there is no problem each of them have\nthis sort of representation. Now, in actual crystal, if you take a piece\nof carbon in graphite or something like that right, if you take an actual piece of carbon,\nthe carbon atoms are actually not so far apart right, they are separated by a fixed spacing\nyou know. There are so many carbon atoms there are so\nmany carbon atoms that are equally spaced in all directions in three dimensions right. I am only drawing here in two dimension because\nthis is a whiteboard of two dimension, but you have z, x, y, in all three dimensions\nyou will have depth and this is a fixed distance by the way. This distance is fixed for each material. The spacing between two the spacing between\ntwo nearby atoms; this is a carbon atoms right. This is called lattice constant. Please remember that ok lattice constant. This is a lattice of atoms actually; this\nis a lattice of atoms. And the spacing between two nearby atoms is\ncalled lattice constant. And this is a fixed number at room temperature\nfor each material right, it is a fixed material for each material it’s a fixed number. Why I am I telling all these, again the eventual\nidea is to understand how bands are formed and what are the bands? Now, I told you that for each individual carbon\natom this is the picture that we have. But I will take a different color may be here. So, let us consider one carbon atom here,\nanother carbon atom very far away, they do not interact with each other ok. There is no problem. Each of them has his own set of orbitals,\nshells, valence orbital’s and everything is there, everything is fine and nice. But this is not the actual distance of carbon\nto carbon atom in a crystal. In a crystal this is much shorter. So, let us now imagine that we are trying\nto bring these carbon atoms close to each other. So, it was here, it was here, but I am bringing\nthem close sorry, so maybe I have a carbon atom here and I have a carbon atom here. So, I have pushed them I am bringing them\ncloser. Why, because eventually the carbon atom has\nto be very close very close as it is a fixed number its some angstrom the level is strong. Actually the carbon atoms have to be close\nto each other in reality. In a real carbon crystal, it is a few angstrom\nok. You know what is Angstrom, 1 angstrom, sorry,\n1 angstrom is 0.1 nanometer, few angstrom is the spacing between 2 carbon atoms that\nis in real crystal. So, I am trying to bring together 2 carbon\natoms, what will happen each carbon atom as its own shells orbitals know it as its own\n1 s 1 s 2 2 s 2 2 p 6 everything is there know. The moment you try to bring them close, the\nmoment you try to as you try to bring them close, this atoms will interact with each\nother. What will happen is that you had this discrete\nenergy levels remember. When I say discrete energy levels, what do\nI mean I mean the levels like 1s you know 2s 2p, these are discrete energy levels fixed,\nfixed energy levels. This discrete energy levels, they will try\nto interact as they are coming closer you know because a real crystal of carbon or silicon\nfor that matter has so many atoms that are closely packed with each other I mean real\ncrystal is real crystal. So, this discrete energy levels will start\nreact you know interacting with each other. And what will happen is that each discrete\nenergy level that discrete energy level which is very sharp will start splitting will start\nsplitting into band. What does it mean is that one energy level\nlike this will become like a band like this, because the atoms are coming closer and there\nvalence orbitals are now interacting with each other right, and that’s why one discrete\nenergy level will now split up. So, how do I, write it more clearly? So, for example, on the x-axis I am plotting\ndistance r, I am plotting distance; on the y-axis, I am plotting energy. So, far away I have see I will not talk about\n1s 2 because the in carbon 1 s 2 is the inner most orbital know. And that inner most orbital exchange do not\ntake part in that interaction so much. And inner most inner most electrons also do\nnot contributed is you know energy band gap formation so much. We will come to that. So, we will only talk about 2 s 2 and 2 p\n2 2 p 2. So, I have a level which is 2 s 2 which is\na sharp discrete level, when r is far away ok. So, this is r, r is large the atoms are very\nlarge and far apart from each other, so these are discrete level that is there. And then you have a discrete level 2p2 which\nis also one single level discrete level ok. Now, you are bringing them close and close,\nso r is reducing. What will happen is that this energy level\nwill now start to split like this ok. This energy level also will try to split like\nthis. Why are they splitting, because they are interacting\nnow. And because they are interacting the levels\nare splitting into a continuum of bands this is called a continuum of states. Actually when I say band there are many small\ndiscrete states that are formed like this. It is called a continuum a continuum of discrete\nlevels which appear they appear as a band ok, they appear as a band. These are discrete levels that are so much\nin number that the whole thing appears like a band an energy band that’s why I am talking\nit is a band; it is not a discrete level. So, this is splitting up here ok. This is splitting up here. And this they will merge for example, ok,\nthey will merge here ok. And then again they will go something like\nthis here. So, I will tell you these are what is happening\nhere is that these are filled I mean these are not filled, I mean these are merge states\nthat are forming. These are merge states that are forming. So, you see in 2s2, there are two states and\nthere are 2 electrons you agree. So, if I take if I take large number of atoms\nsay n atoms, there will be 2 N states and 2 N electrons. Do you agree? N is a large number, in p you have 6 N states. If I have N atoms, I have only 2 N electrons. So, in this part now as just splitting the\nbands is splitting right, this part you see this is by the way r is decreasing ok, r is\ndecreasing, your distance is decreasing. What does it mean, it means the atoms are\ncoming closer and closer ok. In this part, this energy states have merged. And what is the total number of available\nstates now 6 N plus 2 N 8 N states are now available, energy states are available. And how many electrons are their 2 N here,\n2 N here, so 4 N electrons available. And there are 8 N states. Are you getting my point? I am talking N is a large number of electrons,\nlarge number of atoms sorry ok. Many carbon atoms are coming together and\nthese are carbon atoms coming together at far away they are discrete levels you are\nright you have learned in your high school and 10, plus 2 physics and chemistry. But as you are bringing them close and close\nthe energy levels are splitting into continuum of levels which look like bands. And these bands will merge. They form this particular you know merged\nbands, and then again they spit up here, because it is actually continuing right this actually\ncontinuing like this, this actually continuing like that ok. So, what happens is that what happens is that\nthis part now this 8 N states will split up is 4 N states here and 4 N states here. This 8 N here know there were 8 N here, they\nsplit up as 4 N and 4 N. And because there are only 4 N electrons, this 4 N electrons\nwill occupy this. So, there will be 4 N electrons here and this\nwill be empty completely, there are no electrons their right. And you see this is this point this distance\nwe say r equilibrium, this is the equilibrium spacing between the atoms in a carbon atom\nwhich what it means is that in a real carbon crystal like graphite this is actually the\ndistance at which the atoms exists distance with respect to each other. And at that point you see there is a gap here,\nthis is a gap know this is completely empty. As I told you four N states are empty and\nthis is 4 N states are filled they are separated by a gap this is called energy gap and we\ncall it energy band gap ok. We call it energy band gap ok, that is how\nenergy band gaps are formed in semi conductor. I can that was a energy verses distance in\na in a splitting of a diagram, but actually what it happens is that I can say that this\nis one fully filled band, this is fully filled band, it is full of electrons it is full of\nelectrons. And then there is a band sorry which is empty\nwhich is empty. This is electrons here; this empty here; it\nis a gap here. This gap is called the energy band gap. And energy band gap is symbol by EG, this\nis energy band gap. So, thank you for your time. We will meet in the next class."}, "5RvKv1im7bY": {"video_id": "5RvKv1im7bY", "title": "Equilibrium carrier concentration", "transcript": "Welcome back. So, we shall continue with our\ndiscussions today. If, you recall in the last lecture what are the things that we studied?\nWe have covered already Fermi Dirac statistics, the probability of finding electron in a semiconductor;\nwe also discussed density of states that is how many states are available for electrons\nto occupy? I told you that you know the product of this density of states and Fermi function,\nthere actually product represents, how many electrons or holes will actually be there?\nWe also introduce the concept of holes by the way right.\nSo, the last lecture was ended with thus discussion on intrinsic and extrinsic semiconductor.\nAnd, I told you, I gave you the expression for intrinsic semiconductor we derived that\nexpression actually for a semiconductor, what is the intrinsic carrier concentration in\na semiconductor which we can express in terms of band gap. It has a lot of actually implications\nfor devices we will come to see that, but we also told that today we shall also do some\nnumericals and try to get simplification of the ideas of the p and n type doping that\nwe have studied ok. How to apply in the numericals, how to actually\nunderstand real world problems? So, those are the things we will cover today. And, if\ntime permits will also go to things like carrier mobility for example, which is very important\nlater on ok. So, let us come back to the last slide of\nwhere we had ended. If you recall this was the slide that we ended right. In the last,\nyou know, I told you that there is an expression for intrinsic carrier concentration, which\ncan be expressed in terms of band gap, right, exponentially in terms of band gap and also\ndepends on N C and N V. If you recall N C and N V are the conduction\nand valence band effective density of states ok. Those numbers are very much temperature\ndependent, there is an expression for N C, there is an expression for N V. We know those\nexpressions, they depend on temperature and effective mass if you recall. And, this expression\nof n i was derived very nicely. I told you, that an intrinsic semiconductor is a semiconductor\nwhere there are no impurities, it is pristine and pure.\nSo, in that case there will always be some electrons and some holes in equal number in\nthe semiconductor, because of thermal energy. For example, in silicon, the intrinsic carrier\nconcentration turns out to be 1.5 into 10 to the power 10 per centimeter cube of both\nelectrons and holes at room temperature ok. I told you that intrinsic semiconductor, n\nis equal to p right, that electrons and holes are equal in number and that is equal to n\ni. So, I multiplied n and p and I got this n i square and n and p can be expressed in\nterms of this right, this particular terms. And so, we got this expression of n i . So, if you recall now I will come to the next\npage now, we will start from here. To make sure that we are not losing track of things,\nI will again it, that the number of electrons in a semiconductor for which, is not very\nhighly doped, is given by n into N C exponential of E F minus E C by K T. This is going to\nbe a very fundamental equation that we will always keep using and using, ok.\nSo, I draw a conduction band and I draw sorry, I draw a valence band. I told you that if\nyou take a middle of line here that is the intrinsic level E i that is always there.\nIf, your Fermi level is in the top half, say for example, if Fermi level is here E F. It\nmeans the semiconductor is n type doped or there are more electrons than holes, and if\nyour Fermi level is in the bottom half, then there are more holes than electrons ok, it\nis p type doped that we know right. So, I told you if a semiconductor is not very\nhighly doped, then this equation holds true ok. This equation holds true and this is very\neasy to actually see N C is a constant right, it depends on temperature and it depends on\neffective mass, it can be calculated, it will be provide in the question. And, it depends\nexponentially on the difference between E C and E F you see, this gap, negative of this\ngap, E F minus E C is the negative of this gap.\nSo, if this gap becomes smaller and smaller, which means the Fermi level keeps coming closer\nand closer; if, the Fermi level comes up like that I am giving in red color, then you will\nhave more electrons. Because, this gap reduces and if the gap reduces, then this minus of\nthis gap know. So, this quantity will increase basically. So, your doping becomes higher.\nOne way to raise the Fermi level closer to the conduction band is to have more electrons,\nwhich means you dope it high. I told you right, there is n-doping, which\nmeans you are adding an pentavalent impurities of things, you have more electrons than what\nyou need, you know each atom will give 1 electron. So, if I for example, phosphorous is a dopant.\nSo, if you add phosphorous atoms, then 1 phosphorous atom will give you 1 extra electron ok.\nSo, if I 10 to the power 10, 10 to the power 15 phosphorous atoms, I will get 10 to the\npower 15 extra electrons. So, that is how I modulate the conductivity because I can\nchange the number of carriers available in the semiconductor for carrying current, that\nis how we do it ok. This equation is going to be very fundamental through out now. So,\nlet us not lose track of this equation. Similarly, for holes we have another equation. p is equal\nto N V exponential of the negative of the gap here, you know. So, it is E V minus E\nF by K B T ok. So, these 2 equations are going to be very\nfundamental. One very important thing to notice here is that these equations are valid when\nthe doping is not very high. And, I told you doping not very high means that this spacing\nshould be at least 3 K T or should be more than that ok. So, this spacing should be 3\nK T or more than that. If, it is not 3 K T or less than 3 K T, then the Fermi level is\ntoo close to conduction band, and this equation will not hold true then you have to use the\nactual Fermi integral ok. Most of the equations and situations in our\nlife will revolve around moderate doping ok. And, that is why this equation will definitely\nhold true ok, this equation will definitely hold true. If, it is a high doping effect\nwe will see that this gap becomes very small and this equation is not holding true. Actually\nfor an intrinsic semiconductor the Fermi level lies close to middle of the band gap, and\nwe multiply the product we got that is equal to n i square and that is how we got the expression\nfor n i. So, let us come to that expression for n i\nnow. I told you intrinsic carrier concentration in a semiconductor depends as N C N V square\nroot exponential of minus band gap by 2 K B T. So, you see it depends on band gap, right,\nit depends also on this quantity and that quantity which is fine. Now, for silicon it\ncomes out to be around 1.5 into 10 to the power 10 per centimeter cube, it is always\nnormalized volume. So, silicon has a band gap of 1.1 e v. What if I take a material\nwhose band gap is lower, say material germanium. Germanium has a band gap of 0.6 8 e v which\nis lower than silicon. If your band gap becomes lower, which means\nif this quantity becomes lower, ok. Negative of the exponent know, if it becomes lower,\nthen this quantity becomes higher right, the whole thing becomes higher. So, basically\nwhat it means? It means that lower band gap material, if your band gap is lower gives\nyou higher intrinsic carrier concentration, ok and, if this band gap is higher, for example,\nif this band gap is higher right. Say for example, I take gallium nitrite, it is a semiconductor\nalso. There are many semiconductors it is band gap is 3.4 e v, which is much larger\nthan silicon right. In that case your if your band gap is much\nhigher then your n i will be much lower. So, what implications does it have? See there\nare different kinds of semiconductors, silicon is one of the most widely used, but there\nis germanium, there is gallium arsenide, all your white light LEDs that you see in the\nmarket and you in your house those are made of gallium nitrite. So, there many semiconductors\nactually, different semiconductors have different band gap. And, because of that different semiconductors\nalso will have different intrinsic carrier concentration right.\nSo, now this intrinsic carrier concentration is the minimum concentration that you will\nalways have in a material. And, under any circumstance you cannot bring it down lower\nthan this because this is thermally generated. So, if you take a semiconductor. If, you take\na semiconductor for example, this is a semiconductor. And, I take 1 metal contact here, I take another\nmetal contact here and I apply voltage, right. The current that I will get and imagine this\nis undoped, this is intrinsic ok, which means this is the purest form of semiconductor that\nyou can get ok. This is the purest form of semiconductor you\ncan get; then, the lowest current you can get you cannot get lower than that ok. The\nlowest current you can get depends on how many carriers are there in the intrinsic condition\nwhich is n i which means, that the lowest current you will get in the semiconductor\nunder any circumstance will be limited by how many free carriers are there at any temperature;\nsay room temperature any other temperature, without adding any impurity, without doping\nit. So, if your back this is the background carrier\nconcentration, this is the background carrier concentration, this is default carrier concentration\nintrinsic carrier concentration you cannot decrease below that. So, if your carrier intrinsic\ncarrier concentration is higher, then this current that you will get is also higher.\nAnd, if your intrinsic carrier concentration is low, then the current that you get also\nis low, which means you know a wider band gap semiconductor like gallium nitrite with\nmuch higher wide band gap, the large band gap, which has much lower intrinsic area concentration\nwill give you a much lower background current, then compare to silicon or germanium; germanium\nwill give even more. Whose band gap is smaller and that is why\nyour n i is higher that is why the background current also will be high. Is it a good thing\nor bad thing? It depends on the application. For example; this will manifest as the leakage\ncurrent in a device like a photo detector or a transistor, you know this, there is something\ncalled a leakage current you know it is not a good current actually it is a leakage it\nis leads to noise. So, that if you have a smaller band gap material like germanium,\nthen your leakage will be higher. For example, germanium for germanium, n i is much higher.\nI forgot the number exactly, but for germanium I think the n i was almost because it has\nlower band gap know. It almost like 10 to the power 14 per centimeter cube close to\nthat, ok so, that is a very large number. So, what it means is that your lower band\ngap material like germanium for example, will lead to inherently higher leakage current\nin devices. So, that is a very important technological you know statement actually because we design\nthe devices based on the band gap. So, is very important to have that. So, this is one\nthing that we learn from there, ok. Now, let us take things 1 by 1 slowly, will\nnot rush things ok. So, let us get the concepts again much better here. So, for example, I\ntake a condition here. So, remember what I what are this E C and E V, if you remember\nI will be keep drawing I will keep drawing this E C and E V very repeatedly now. Remember\nthat 1 to 1 equivalence E C and E V this is actually comes from e k diagram only this\nis except this is x in centimeter ok. So, this is this line basically represents\nthe bottom of the conduction band in that e k diagram over position it is flat ok, over\nposition it is flat basically it is a constant band gap material like that, that is what\nwe mean ok. This is the actually this is the valence band which is filled up right and\nthis is the conduction band which is nearly empty. So, that thing actually comes, but\nI do not represent this all I just give it a straight line that is it that is how we\ndevice engineers do that ok. Now, if I suppose tell you that I have N C\nof say 3 into 10 to the power 19, that is the number that is given ok. N C is the conduction\nband effective density of states. And, I told you that I have doped the material you know\nI can add doping, and I can increase or decrease, I can increase the conductivity, where I can\ntune the conductivity. So, external dopants are added know in a silicon for example, phosphorous\nis a donor that will give you electron I told you. So, the donor density is always represented\nby N D. It means the density of it means the density of dopants that you are adding right\nor density of donors that you are adding ok. How many donors you are adding? Ok.\nAnd, N A represents to how many acceptors you are adding for p type doping ok, density\nof acceptors. I told you already, if you recall that atoms like phosphorous which can give\nelectrons like phosphorous or arsenic they give electrons to silicon, they donate electrons\nthat is why they are called donors and these are basically n-type doping, they lead to\nincrease in electrons and acceptors like boron for example, they are able to accept one electron\nand give a hole out. So, they actually are p type doping because they lead to higher\nholes ok. So, N A is the density of acceptor and N D is the density of donor . So, now,\nI tell you for example, if I take you a case I will just read out this case again. So, for example, I have conduction band here,\nI have valence band here ok. And, I tell you that you see N C is given to be 3 into 10\nto the power 19, this is a at room temperature, it changes, with temperature by the way ok,\nthis is fixed number per centimeter cube. And, then I tell you that I have doped the\nmaterial with phosphorous N type, N D is equal to for example, say 10 to the power 17 per\ncentimeter cube ok, 10 to the power 17 per centimeter cube, that is the number of phosphorous\natoms I have added. So, that is the number of electrons basically that I am getting extra.\nSo, what is the position of the Fermi level within the band gap. The question is inside\nthe band gap what is the position of the Fermi level? Now, because this is N type dope you\nimmediately know that Fermi level will be in the top half, in this half region it will\nbe there know. What is the exact position of the Fermi level? In other words, what is\nthe difference between the position of the Fermi level will be somewhere here. What is\nthis E C minus E F, can you do that, that is an equation we have know, I told you n\nis equal to N C exponential of E F minus E C by k T.\nSo, here you see if I take this n by N C then I can take a log, natural log here and that\nwill become E F minus E C by k T. I can bring the k T here actually. So, E F minus E C,\nE F minus E C, the negative of this gap is given by actually this quantity which is k\nT is 0.026 e V ok. 0.026. that is the room temperature into log of n by N C. I told you\nN is equal to N only right. Because, that is the number of doping you added and that\nis the number of electrons you are going to get. So, that will be 10 to the power 17 by\n3 into 10 to the power 19. So, you can take a log of this number know\nwhat will be. I do not have a calculator here, but you can do log of 10 to power 17 by 3\ninto 10 to the power nineteen. So, this is like log of 1 by 300 only. So, some negative\nquantity will come, of course, will be negative know this is E F minus E C. E F minus E C\nwill be negative because this is the gap. So, you can do that and you will find out\nsome number. So, it might come out I do not know you have to do a calculator, but may\nbe it comes out to be say 0 point say around 2 e v may be I do not know it may be wrong\nit may be 0.3 also I am just telling you. So, this will be 0.2 e v right, because they\nhave negative of that right. That is how you solve a problem, what is the position? And,\nif your position is given then you can back calculate and calculate this term N D right.\nSimilar thing can be done for holes . So, that is an important thing. Now, for example, now the important thing\nis that I told you about n i, I already told you about intrinsic carrier concentration,\nI told you about this doping and how you know we can do this simple numerical, there are\nsome conceptual questions that the textbooks do not talk about. So, while I am in the topic\nI will tell you also those, there are some conceptual questions ok. You see this band\ngap that is there this within this band gap. Actually, this is a forbidden gap ok. Because,\nsee this is a forbidden gap, why do you know it is a forbidden gap, because I told you\nthis is actually filled with electrons and this is nearly empty, but you can get extra\nelectrons here which can move, this is a forbidden gap. So, carriers cannot exist within this\nband gap, within this band gap, you cannot have carriers because, this is forbidden gap.\nSuppose you have a Fermi level here ok. Suppose, you have a Fermi level here, the Fermi level\ntells you that there is a 50 percent chance of finding electron here, at the Fermi level,\nif you recall Fermi Dirac. The question is, if electrons and holes cannot exist within\nthis band gap, it is a forbidden gap ok. Then, how come there is a 50 percent chance of finding\nthe electron here, does it mean there is a 50 percent chance of actually finding a electron\nhere right. The solution to the paradox is that Fermi level is only a statistical construct,\nit makes lives easier to understand many of these things ok, it is not a real level here.\nWhat it means is that of course, electrons cannot exists within the band gap. Within\nthe band gap electrons will not exist, but, here it means that there is a higher probability\nof finding electron here, you know than finding a hole here for example, ok. So, it means\nthat there is a 50 percent chance of finding here. it is the statistical construct that\ntells you how close you are to finding the electron in the conduction band, it is what\nis the probability here? So, there is higher probability you will find lower probability\nwill find hole or stuff like that. So, it basically gives you a number as to\nwhat is the probability? And, this probability itself will not tell you electrons will be\nthere or not. I told you there is density of states also, you remember density of states.\nSo, only density of states times the probability both has to be multiplied, both has to be\nmultiplied only then you will get the number just because there 50 percent probability\nhere does not mean you will find a electron here. Because, the density of states is 0\nhere. 0 multiplied by probability 0, you need to have some density of states and density\nof states are only here. So, basically you have to multiply both together.\nSo, one of them alone cannot tell you/ fifty percent probability does not mean there is\nan electron ok. It is a probability times the density of states that will give you the\nexact number of electron, same with holes. So, this is one thing they may not many may\nnot tell you so much. Another thing the people often do not tell you is that you see I we\ntypically draw a conduction band and then valence band. Of course, there is an intrinsic\nlevel at the middle at the middle of the gap, this is half way through. And, suppose this\nis N type dope material or even p type. So, n type will be say Fermi level is here right.\nSee these are straight these lines are very straight right if you recall these lines are\nvery straight right, whenever there is a straight line what does it mean? It mean actually it\nmeans there is no field. I will come to that very quickly now. You see the Fermi level\nhere it is straight, the Fermi level has to be flat, Fermi level has to be flat in equilibrium.\nWhat does it mean? It means that there cannot be a slope in the Fermi level. Your Fermi\nlevel cannot have a slope. The moment you have a slope in Fermi level\nit means current is flowing. So, in equilibrium when I say equilibrium there is no current\nflowing, your Fermi level has to be same because the probablity the electrons has to be same\neverywhere. If the Fermi level is tilting, for example, I go back here I will go to new\npage may be you know. Suppose, I have a conduction band here, valence\nband here, and then I say that Fermi level is like this. This is not possible in equilibrium.\nThis will mean it is non-equilibrium, why, because, you know a slope in the Fermi level\nthis is the slope know. A slope in the Fermi level implies that there is a current that\nis flowing. And, if current is flowing then it means there is non-equilibrium.\nSo, your Fermi level cannot have a slope ok. The Fermi level has to be straight that is\n1 very important thing, in equilibrium. Of course, if it is non-equilibrium, then Fermi\nlevel can have slope ok. So, please keep it in mind, many of the textbook do not tell\nyou that ok. Another thing that textbook do not tell you\nis that, if you have a conduction band and valence band that are flat; Fermi level may\nbe here, p type dope material may be, if these are flat there is no slope right, no slope,\nthis has also no slope right. Of course, they are same band gap there is no slope. It means\nthat what does it mean it means that there is no electric field in the material, there\nis no electric field in the material ok, there is no electric field in the material. Because,\nif there is a slope; that means, that the potential is changing basically. And, if the\npotential is changing then the field also will come, right, because this energy are\nactually reflecting their potential only. So, a flat profile means that there is no\nfield ok. They have sense of field that is what it means. Because, if you recall from\nhigh school, field is nothing, but the negative of the slope of potential, you remember that,\nit is a gradient of the potential. And, this energy band diagram that I keep drawing, this\none know, this energy is actually energy of the electron. This E C E V whatever we draw\nknow, energy bands. This energy bands actually represent the energy of electron ok. These\nrepresent the energy of electrons. And energy of electrons is given by you know what negative\nof the charge is there of course, times V, V is the potential. So, potential time the\nnegative of charge electron will give you the energy of the electron.\nSo, essentially this will become 1 by q d E C by d x. So, if the bands are flat, then\nthe derivative of that is 0 know. So, the field is 0. So, whenever there is a slope\nin the electric field, slope in the energy band sorry then you know the electric field. For example, if I have E C like that, E V\nlike that then; that means, there is a slope; that means, there is a field here ok. This\ncan be or cannot be in equilibrium, because I have not drawn the Fermi level here. I have\nnot drawn the Fermi level here this is x here by the way ok, but this is slope means that\nthere is a field, whether equilibrium or nor equilibrium is not a concern right now here\nok. So, now let us take I am trying to solve some\nsimple questions. So, that know things become more and more clear. So, that is one important\nthing. Now, suppose I have, let us suppose I have\nsilicon 2 pieces of silicon, there is 1 piece here; E C E V exactly there is one here, another\npiece of silicon E C E V. In one, the Fermi level is here, in one the Fermi level is here,\nwhich has higher electron. Of course, this is higher electron. Because, the Fermi level\nis closer to the conduction band this also means this higher electron, it may also means\nthat this is higher doping. Now suppose, now suppose, what I will do is\nthat, this is x the x axis is distance you know that right, this x axis is distance you\nknow that right. Now, suppose I take a piece of semiconductor,\nI take a piece of semiconductor, this is the piece of semiconductor, from this point say\nx equal to 0 this point, and say that length of the semiconductor is say 1 micron, 1 micron\nok, this is this. From this side to that side ok, from this side to that side, I gradually,\nI gradually increase the doping; I gradually increase the doping n type doping, what is\nhappening second, doping the increasing the n-type doping, which means, from this side,\nI am increasing the doping n-type doping gradually to this side, I am doping it more and more.\nFor example, at this side, I have a doping of 10 to the power 16 per centimeter cube.\nI slowly keep increasing 2 into 10 to the power, gradually I keep and here I become\n10 to the power 17 per centimeter cube for example. So, that doping is gradually increasing\nfrom left to right. So, this part becomes more doping, this side becomes less doping\nand gradually it is changing. It is in equilibrium which means there is no current flowing, how\nwill it look like now how will the energy band diagram look like. These are the concepts\nthat textbooks often do not tell you, how will the concept look like.\nSo, for example, the band gap is remain same, doping will not change the band gap right.\nAt least the moderate doping you are talking about. If, it is in equilibrium, one thing\nthat you know is that what, your Fermi level will stay constant you agree, if your Fermi\nlevel will stays constant; that means, I will first draw the Fermi level here. So, this\nis your Fermi level which has state constant ok. sorry. This is your Fermi level which\nis constant. Now, on the left side the doping is lower\nand the right side the doping is higher. If you recall, the E C minus E F this spacing,\nE C minus E F this becomes smaller for higher doping and larger for smaller doping. So,\non this side this is the left side right, x equal to 0 this is x equal to 1 micron.\nAt this side the doping is lower right. So, your E C minus E F will be at some positions.\nSo, here 10 to the power 16 scale this is here, this is E C. But now other side, the\ndoping has increased. So, your E C will be closer here than here right ,you agree, the\nyou know the E C will be closer there than here.\nSo, what will happen is that your conduction band will bend like this. And, your valence\nband of course also will bend like that, because the band gap has to remain constant. If one\nbends the other has to bend otherwise the band gap will not remain constant know this\nspacing the gap will not remain constant. So, what it means? It means the Fermi level\nis here sorry, Fermi level is here, it is a constant 1 line, I am very bad at drawing\nthis is Fermi level E F. And, your conduction band has been drifting like this changing\nlike that, why because this position is far. So, less doping this is low. So, higher doping\nok, conduction band valence band will go like that.\nNow, you see there is a slope there, is a slope in the conduction band, slope in the\nvalence band, it means that there is a field. A slope in the conduction band means that\nthere is a field for field experienced by electrons, slope in the valence band means\nthere is a field experienced by the holes. So, of course, both electrons and holes now\nthey have a same band gap of course. So, electrons and holes will experience a field, which way\nwill the field be do you know. See, if there is a concentration gradient\nof see there is 10 to the power 16 electrons here, there is 10 to the power 17 electrons\nhere, then there is a concentration gradient, you agree. So, there are more things associated\nwith this actually, will come to that, it is called diffusion. If there is a concentration\ngradient of species, then you will always the it always tries to go from the higher\nconcentration area to the lower concentration area right. If you spray deodorant in one\ncorner of the room, the particles of the deodorant are highly concentrated in that corner.\nSo, it will diffuse through the corners where it is low. So, the whole room will start after\nsome smelling that deodorant after some time right. So, electrons also try to diffuse from\nthe higher region, from here it will try to diffuse from here right, it will try to diffuse\nfrom here to this side it will try to diffuse. Because, electrons are higher concentration\nhere lower concentration here, but that will lead to a flow of current know, if electrons\nmove. So, that current is balanced by this electric field that is there, electric field\nwill not allow that to happen ok. So, I will tell a little it more about electric field\nhere before we go to the next concept. So, if your conduction band looks like that,\nthis is your Fermi level ok. And, then your valence band looks like this, there is a slope\nhere that I agree, which direction is the electric field do you know, a very easy way\nto find out which direction the electric field is, I told you if there is a slope there is\na electric field. A very easy way to find out which direction the electric field is,\nis think of this of this as a concrete floor a slope like that right. And, you think of\nan electron here as like a cosco ball or tennis ball, it will try to roll this side know,\nwhich means electrons will try to move in this direction. Because, it will rolling in\nthis direction not diffusion ok. This is the drift actually this is rolling\ndown, which means the field will be in this direction because electrons will move opposite\nto field. So, that is how we quickly find out which direction is the electric field\nok. Now, this is a separate case I will come to this very quickly in sometime, but you\nknow this is a case the people do not talk about mostly in textbooks, as to the field\nexistence of field can be inferred from a slope in the band diagram. Fermi level has\nto be flat, if this Fermi level has the slope; that means, there is a current is flowing\nok. Now, these are with doping by the way. And,\ndoping is very essential to increase or decrease the number of electrons or holes and that\nis how I, you know, we change the conductivity of the material by tuning the electron or\nhole density. If, it is of course, undoped then n i is that n i that we talked about\nand n i expression has been there. So, n i depends exponentially on band gap, it is also\ndepends exponentially on temperature right. Now, the question is there is something called\nmass section law actually, balance section you know in a way. So, what happens is that,\nfor example, I told you that for moderate doping, n is equal to N C e to the power E\nF minus E C by k T right. And, then you have p equal to N V e to the power E V minus E\nF by k T right. And, this is not intrinsic, ok, this is not intrinsic, I am talking about\ndoped, I am talking about doped material for example, not intrinsic not intrinsic.\nSo, if I multiply n and p, I get N C N V into e to the power minus E C minus E V by k T,\nright, which is nothing actually, but if I take a square root here take a 2 here then\nI can take a square here this quantity is actually n i. So, the product of p and n will\nalways be equal to n i square at equilibrium, this is a very fundamental rule ok. The product\nof p and n will always be equal to n i square it is a rule ok, it is a fundamental rule\nunder equilibrium it will always be true. So, what does it mean? It means that suppose\nI have a material, I have a semiconductor silicon which is say n type doped, with say\n10 to the power 17 per centimeter cube of doping, this is a donor atom right. So, this\nis donor doping which means so many phosphorous atoms have been put actually or arsenic atoms\nhave been put. So, so many electrons also will get. So, the number of electrons actually\nis equal to this right. So, how many holes will be there? How many\nholes will be there? In this material, how many holes will be there, naturally holes\nwill be lower in number know, because I have added more electrons here, donor will give\nyou electrons. So, these many number of electrons are there. Whatever number of dopants you\nhave added, that many number of electrons will be there that is what we are you know\nassuming till now that is ok. How many holes will be there? You know n i\nfor silicon is 1.5 into 10 to the power 10 per centimeter cube and I told you this p\ninto n will always be equal to n i square, which means p will be equal to n i square\nby n, which means that will be 1.5 will be how much, this square will be how much 2.25\ninto 10 to the power 20. And, n i n is n n is given to be this 10 to the power 17. So,\np will be equal to 2.25 into 10 to the power 3 per centimeter cube, you see the number\nof hole is 10 to the power 3, number of electrons is 10 to the power 17, huge difference you\nknow. So, that is why it is called, you know, n\ntype dope semiconductor there are more electrons than holes, but see the number 10 to the power\n17 electrons and 10 to the power 3 holes. Because, there so, many so, few holes this\nis called minority ok. And, this is called majority, this is called majority electron\ndoping. So, if you dope n type the electrons become majority and the holes become minority,\nyou agree becomes minority and becomes majority. And, similarly if you dope p type if I instead\nof this if I put a p type doping then the holes become majority and electrons become\nminority ok. So, let us wrap up the lecture here today\nlet us wrap up the lecture here today. We have discussed about doping we solved very\nfundamental simple problems of doping, I told you, few things that the textbooks generally\ndo not tell you ,one is that your slope in the Fermi level means that the current is\nflowing it is not on equilibrium. So, if a device or material is in equilibrium, Fermi\nlevel cannot have a slope which has to be straight. It is all with respect to the position\nby the way and conduction band and valence band, a slope in their profile means there\nis a field I told you how that field comes right.\nSo, if and there can be equilibrium or may not be equilibrium we do not know, but a slope\nin conduction and valence band definitely means there are fields there ok. So, I told\nyou about intrinsic carrier concentration, how it depends on band gap, how it also has\na role in or devices, because leakage current will be high or noise will be higher. For\na photo detector for example, made of lower band gap material, then compared to higher\nband gap material. Because, the intrinsic carrier concentration is the base line, the\nminimum carrier concentration that you will have you cannot go lower than that ok.\nAnd, I told you that you know just now I told you here that x, your electrons and holes\nhow you calculate the number. If your doping n type, then electrons are majority holes\nare minority and vice versa. p into n will be always is equal to n i square. So, if you\nknow the n i you can always calculate p or n if the other value is given. I also told\nyou that, you know if you dope it n type the dopant is called donor because it is donating\nelectron and p type dopant is called acceptor because it is accepting electron and giving\nyou holes basically right. And, I told you that if you had 1 phosphorus atom, you get\n1 electron that always need not be true in need not hold true.\nSo, those things we will come in the next class, incomplete ionization incomplete ionization\nand little bit more advance on this before we go to mobility and scattering, which I\nalready introduced in a briefly, the diffusion thing I told you all those things will depend\non mobility also the drift and diffusion ok. So, will come to that before that we will\ncover a few of the slightly more advanced things, but with examples and numericals;\nso, that we will take up in the next class. Thank you."}, "7lx7p03jFKU": {"video_id": "7lx7p03jFKU", "title": "High doping effects and incomplete ionization", "transcript": "Yeah  welcome back. So, we had concluded the last\nlecture with temperature dependence of carrier density. If you recall, we also had discussed\nabout charge neutrality so, the total positive and negative charge has to be same in a semiconductor.\nSo, now, we shall go ahead and we shall wrap up this discussions with a few notes you know\non things like high doping incomplete ionization and then will move to things like mobility\nand drift diffusion so that we can discuss about current transport.\nOnce we discuss about current transport, we can discuss devices like p n junction that\nmakes the LEDs, photo detectors, solar cells, BJTs and so on. Things like MOSFET and different\nkinds of transistors, optical devices everything can be understood when we understand how electrons\nflow and that is carrier transport and primarily governed by drift and diffusion sort of a\ntransport ok. And for that we need concepts like mobility and velocity. And before understanding\nmobility and velocity, we need the concepts of carrier concentration, how they change\nwith temperature, you know conductivity and so on. So, that is what we are doing it. And\nif you recall from the beginning of this course, we had actually covered basics of band gap,\ncarrier concentration and reciprocal space and now we are building up to the carrier\nstatistics, how carriers are distributed and how we calculate the carrier density things\nlike electron and hole density and so on. So, now today we shall focus on high doping\neffects and incomplete ionization, and we shall thus conclude the initial section of\nthe few lectures on carrier density, carrier recombination or carrier statistics and you\nknow density of states and so on; so, that we can move to devices ok. So, today we shall\ncome to the whiteboard now and will get start get started high doping effects ok. So, if you recall in the last lecture, we\nhad in the last few lectures we have talked about you know n type and p type doping. And\nhow do we dope them by adding impurities, we know that now. This equation is very you\nknow very very familiar to you exponential of E F minus E C by k T. So, you know I told\nyou that this Maxwell Boltzamann equation is valid when your E F and E C, this gap is\nmore than, at least more than 3 k T right. At room temperature, this is around you know\n78 milli electron volt. So; that means, it is slightly moderate or\nlighter doping and this equation is valid under such circumstance and you can use this\nformula to calculate the electron concentration you know N C very well. I told you that if\nyour doping keeps increasing, then your fermi level keeps going up and up right ,n type\ndoping and if your p type doping increases, then your fermi level keeps coming down and\ndown. So, if I dope it relatively higher ok; if I dope it relatively higher, such that\nyou know your fermi level, your fermi level comes very close to conduction band. So, that\nthis gap this E C minus E F, this is very close. So, this is less than 3 k T.\nFor example at room temperature 3 k T is around 78 milli electron volt, but if I dope it very\nhigh so that your fermi level comes sufficiently close to conduction band such that it is less\nthan 78 milli electron volt. Say you know, if I say that E C minus E F, this gap you\nknow this gap is suppose only say 50 milli electron volt at room temperature which is\nless than 3 k T, then this equation of Maxwell Boltzmann equation cannot be applied you know,\nwhy? Because this Maxwell Boltzmann equation came if you remember from this equation equal,\nn equal to N C the fermi half dirac integral remember and this expression can be actually\nsimplified to this particular expression, exponential only when the doping is light\nor when you know your E F minus E C, this gap is actually more than 3 k T.\nSo, if it is more if it is higher, less than 3 k T its doping is very high. So, if the doping I am talking about n type,\nsame will apply for p type also, if doping is too high right. If doping is too high which\nmeans say for n type what it means is that your sorry your E F, your E C minus E F this\ngap has become less than 3 k T right. That is called high doping effect. And for p type,\nit means that your E F minus E V has become less than 3 k T, right. So, in this case your\ndoping is very high, you cannot apply Maxwell Boltzmann equation to calculate n and p. What\nyou do is you use know you that expression was there know n equal to N C, this you try\nto sort of do an approximation of this for high doping because calculating this exact\nintegral will need you a MATLAB or mathematica kind of software and it is little also complicated.\nSo, can we do some simplification. So, that is an approximation called Joyce-Dixon\napproximation. Joyce-Dixon approximation, and this Joyce-Dixon approximation will basically\nhelp us to calculate the carrier concentration when your doping is high. Suppose I am you\nknow I am giving a practical problem when your conduction band and your fermi level\nare very close, I tell you that this distance is only 50 m e V ok. What do you do now? How\ndo you find out n? I tell you that N C is equal to say 10 to the power 19. How will\nyou find out n now? So, if you recall, E F minus E C by k T is\ngiven by ln right of n by N C if you recall that right is given by n by N C. That is your\nMaxwell Boltzmann equation actually. This you know the expression that I have written\nin the previous slide, sorry this equation I have written. This is the equation actually,\nI am writing it in a different way, same equation I am writing in a different way. So, this\nis the expression right. For Joyce-Dixon, you add just one more term. You know what\nthe term is, you add one more term and that term is plus, I will use the blue color 1\nby square root of 8, n by N C. This is your Joyce-Dixon approximation that you can apply.\nWhen a doping is high so that your E F minus E C is less than 3 k T. If you can you can\nuse this approximation and you can calculate n.\nFor example, you see that this is a transcendental equation. It is in the form of log x plus\nsome constant term x right. So, it is a transcendental equation. Finding n directly you will you\nwill have to do some numerical and iterative process, but it still can give you a better\nidea. So, for example, if I tell you that E F minus E C is equal to 50 meV, then how\nwill you solve this equation, right? So, it is very easy to solve now. So, I have told you that E C minus E F is\n50 meV which means E F minus E C is minus 0.05, right that is 50 meV is 0.05 right.\nSo, Joyce-Dixon approximation says that E F minus E C by k T equal to ln n by N C plus\n1 by square root of n by N C, ok. So, you know I assuming hundred percent ionization.\nSo, whatever n type doping I am giving is equal to n only I saying right. There is no\np type doping. So, you can replace this n with N D also not an issue. Now this quantity,\nyou know this quantity, I can write as minus 0.050 and k T at room temperature is given\nby 0.026. So, this is roughly around minus 2, not exactly, but close to minus 2. This\nis equal to log of n by N C plus 1 by square root of n by N C. So, this N C is supposed\nto be given in the question. So, suppose it is 10 to the power 19 right sorry. So, it\nis given to be 10 to the power 19. So, now there is only one unknown. This is\nequal to minus 2 right close to minus 2. So, it is only one unknown. So, you can actually\ndo a couple of iteration or even put numerical solver and find out what is n, right, so,\nthat is good. Same thing can be done for p type also. So, this is the high doping effect.\nSo, when your doping is high, right when your doping is high, you have to apply Joyce-Dixon\napproximation to find out the carrier concentration and another thing is if you keep doping higher\nand higher, then your fermi level keeps going up and up know. So, suppose this is your conduction band,\nthis is your fermi level valence band. If you keep doping high and high eventually the\nfermi level can actually almost touch the conduction band, very high doping. In such\ncase we call it is a almost degenerate doping ok. So, super high doping. I am talking about\nn type only, but same will apply for p type also; in the p type fermi level will touch\nthe valence band. So, here you see, the fermi level will almost touch the conduction band.\nIt can even go above the conduction band you know; it can even go above the conduction,\nthe fermi level can be above the conduction band also, if you dope it extremely high,\nthe conduction band might actually come below the fermi level. If it is doped extremely\nvery high if it is doped very high know very high doping, you know what will happen? Couple\nof things will take place actually. One very important thing is that your band gap of the\nmaterial will slightly shrink or reduce. When you dope very high, your band gap will\nslightly reduce. So, for example, silicon band gap is 1.1 electron volt. If you dope\nit very high; suppose you dope it n type say 10 to the power 20, this band gap will now\nbecome smaller slightly. It may I do not know exactly how much it I mean I forgot the value,\nbut it will become slightly smaller; it might become 1 electron volt or it might even become\nyou know 0.9 electron volt. Do you know why? Because, with very high doping with extremely\nhigh doping you are putting too many of substituent atoms into the crystal that distort the lattice\nand your you know periodicity gets also distorted to some extent. The periodic potential that\nyou have and you actually have you know this you have this periodic potential.\nIf you remember the atom atoms are all equally spaced apart right and when you dope it is\nactually like one in a million. So, you know out of one million silicon atoms only one\nwill be replaced by say phosphorous, so, phosphorous. But, if you dope very high, then you know\nthere will be more phosphorous for example, so, what happens is that the periodicity is\nsort of distorted and also that effects the band gap. So, you have things like band tails,\nband tails, which means the distribution actually extends below that you know band gap also. So, for example, if you have to many doping\ndopant atoms; if you have too many dopant atoms if you have too many dopant atoms, then\nbecause you are distorting the periodic potential or you know you are distorting the periodic\narrangements of the atoms your what is what should be this E C and E V actually becomes\nlittle bit you know what it becomes is that, it becomes little bit jagged like it becomes\nslightly like this E C E V. The band gap is always same at any point which\nis reduced slightly, but it becomes little jagged or little because this perturbation\nin the periodic crystal that will manifest itself as a not completely smooth conduction\nvalence band over a position. You know, there will be periodic there will be a like a potential\nfluctuations ok; there will be potential fluctuations that will result in a band diagram like this.\nWe do not have to delete in day to day device analysis, but it just important to know that\nyour, there is a you know there is a there is a fluctuation in the bandage and there\nis something called band tails. So, you know your fermi dirac distribution will extent\nlittle below the band also, will extend below the band also and so, your band gap also will\nshrink, right. Your new band gap E G dash will slightly smaller than actually the true\nband gap of the material. So, there is a lot of interactions between\nelectron-electron and electron and donors or dopants right. So, too many interactions\nare there and all these interactions dopant-dopant interaction. This all interactions increase;\nthis all interactions increase in magnitude when your doping is very high and all this\ninteractions seek to lower the band gap ok. So, this is one effect you should keep in\nmind. You know with very high doping for example, your band gap will slightly shrink that is\none thing we should keep in mind. It is very important you know implications actually later\non in devices and also you should keep in mind that high doping Maxwell Boltzmann equation\ncannot be applied so, you have to apply Joyce-Dixon approximation. There are band edge perturbations\nand so on. So, these are the things that we should you\nknow keep in mind when they are very high doping effects. I told you conduction band\nyou know fermi level, can actually go above the conduction band is very much possible\nis degenerate doping. It is extremely high doping and such high doping material you know,\nyou know are typically not used in many devices, but there will be some devices where you have\nto dope very high. So, it is important to know that and then another thing we would\nlike to discuss before we go to topics of you know mobility and carrier velocity and\nother things which are important for transport is called incomplete ionization. We should just be aware of this term we do\nnot have to do the exact numericals or mathematics of this, but we should be aware of what is\nincomplete ionization. You know I had told probably in a very brief thing some of the\nlast classes may be. I told you that in general, if I am only consider say n type doping, there\nis no suppose p type doping ok; n type doping. I told you that if I add 10 to the power say\n16 donor atoms, say phosphorus and silicon, you know all of them are actually ionized\nwhich means all of them are giving electrons right.\nSo, I will get 10 to the power 16 electrons per centimeter cube, right, electrons per\ncentimeter cube and so, I said that the free electron concentration is equal to the donor\nconcentration, right. This is assuming 100 percent ionization or 100 percent of this\ndonors are actually ionized. And typically they are hundred percent ionized because I\ntold you this is conduction band; this is valence band. And if I draw there is a there\nis a ionization energy level actually, donor energy level say this is E D, the donor that\nyou are putting you know like phosphorous for example, you are putting phosphorous in\nsilicon as an n type dopant. If you do phosphorous in silicon, then this\nphosphorous will introduce a donor energy level which is very close actually very very\nclose ok. This energy difference between E D, the donor energy level and E C is k T or\nless than k T know less than k T which means at room temperature it is sufficient energy\nis there thermal vibration to put all the electrons up in the conduction band. All the\nelectrons are put in conduction band and that is why if you put 100 of this, all 100 will\ngive you electrons that is why, 10 to the power 16 will give you 10 to the power 16;\nsame thing with holes also for valence band. Now, if for some material the doping is such\nthat the donor ionization energy level is not so close, then what will happen? Then\nnot all of them will get ionized right. So, for example, I take E C, sorry, suppose\nI take E V here and then there is a donor ionization energy level E D which is little\nfar away because the donor, the impurity that you are adding is such that it introduces\na donor level little far away. Suppose this is you know 3 k T or may be say 0.1 e V which\nis almost equal to 4 k T almost right. 0.1 e V electron volt is little large four times\nthe thermal energy. So, all the donor atoms that are there I mean not be able to give\nelectrons may be some of them will give electrons some of them will not give electrons. May\nbe if you put 100 of this phosphorous atoms or donor atoms, may be only 60 of them will\ngive electrons rest 40 will not give electrons. So, we see only 60 percent has ionized, 40\npercent has not ionized and the donor energy level is E D. Further away this E D is from\nconduction band more and more it is possible that the ionization fraction has reduced.\nSo, what is the fraction that has ionized? So, I told you typically you know if you assume\nhundred percent ionization, then N D is equal to n which is equal to N D plus because all\nof them has ionized, all the atoms have ionized basically, right. But if it is incomplete\nionization, then this is not true, right, the fraction that is ionized N D plus by N\nD typically it is 100 percent if it is fully ionized, 1 that is 1. But if it is incomplete\nionize, then it will not be 1; it will be something like this, it will be something\nlike this ok. So, the fraction of ionized donors will depend\nas 1 by 1 this is a actually a fermi dirac distribution only, 1 plus 2 into exponential\nof E F minus E D see E F the fermi level comes into picture minus E D, the donor level here.\nThe fermi level will be somewhere here know. So, fermi level minus donor level divided\nby k T, and this factor 2 comes because of spin, 2 states you know the spin. So, that\nis a factor of 2 comes there. So, for example, if I know the fermi level position and if\nI know the donor ionization energy level position, I know that what fraction of donors has ionized\nactually. For example, if the fermi level and the donor\nlevel are the same time, at the same level, E F is equal to E D. So, the fermi level and\ndonor level at the same position then this will become 0, becomes 1. So, it will become\n1 by 1 plus 2, 1 by 3. So, 33 percent of donors will be ionized if fermi level is equal to\ndonor ionization energy level right. So, only that similarly for holes I mean this is an\nimportant thing actually not everything has to ionize similarly for holes. N A minus by N A this is the fraction of holes\nthe not fraction of holes the fraction of acceptors that are ionized. Remember, when\nthey ionize they give a hole or take away electron so that have become negatively charged.\nThis is the fraction that is ionized, that is given by 1 by 1 plus 4 exponential of E\nA minus E F here. This is the acceptor ionization energy by k T. The reason this 4 comes because\nof heavy hole and light hole and then there is a spin so, 4 ok. You remember that for\nsay n type doping, your electron, only if you have a electron n type doping, then the\ntotal electron, the negative concentration has to be equal total positive concentration.\nThis will always be true for an n type dope material ok. Even if it is incompletely ionized\nit is always true, these N D plus need not be equal to N D if it is not 100 percent ionized.\nSo, n will always be equal to N D plus, but whether all the N D plus comes from N D some\nof them may not have come from N D. If it is 100 percent ionized, this will be hold\ntrue. If it is not 100 percent ionized, this will now whole true. So, say 60 percent ionized\nor may be 50 percent, but this will always hold true same thing with holes ok. This will\nalways be true, but this need not be true, this need not be true. So, that you know that\nwe should keep in mind. So now, if you have you know, I told you that\nif you have both electron and hole doping, then the total positive charge is this, total\nnegative charge is this. This will always hold true except that this and this need not\nbe 100 percent ionized, need not be 100 percent ionized. They can be incompletely ionized\nalso. So, for example, you know you have seen the\nwhite LEDs that you can buy from the market, you can buy white LEDs for 100 rupees or so.\nThis white LEDs are actually in fact, blue LEDs and this blue LEDs, they have a phosphor\ncoating they, have a phosphor coating to convert the blue light to white . And this blue LEDs\nare always made up of gallium nitride. It is a semiconductor. All the white LEDs that\nyou see in your parking garage, on the streets, in the airports, in your houses, to stadiums\nall the white LEDs are actually made of gallium nitride semiconductor. And actually a gallium\nnitride p-n junction, a gallium nitride p-n junction will actually be the white LED that\nis what is happening. There is little bit more to it not telling you right now. But\nthat is what is happening will talk about p-n junction later. Why I am telling you this,\nbecause in gallium nitride, p type doping, for p type doping you have to add magnesium.\nThe moment you add magnesium to gallium nitride, you can dope it p type. This magnesium is\nvery less ionized. You know what, only 1 to 5 percent is ionized as a p type, which means\nif I add 10 to the power 17 magnesium atoms, only 10 to the power 15 holes I will get.\nIt is so low and that has implication in the gallium nitride p-n junction which has implication\nin the white LED. So, these are important things that we should keep in mind. So, incomplete\nionization is not something very fancy that we have to study only for our course. It is\nvery important for practical devices like white LEDs, right. So, we should keep that\nin mind. So, now we have finished up many things see.\nGoing from the beginning, we have defined semiconductor bands right. We have defined\nreciprocal space. In this course, I am just taking a stalk here ok. We have defined reciprocal\nspace and things like Brillouine zone. Why they are important? I have told you how band\nenergy bands are formed and energy band gap is formed right, how energy band gap is formed.\nIf you recall the periodic potential, the periodic arrangement of the atoms, periodic\npotential right so, how energy band gap is formed. And I told you about things like effective\nmass of electrons, how the entire quantum mechanics is captured in the E-K diagram and\neffective mass comes from there. Electrons going from valence to conduction band leaves\nbehind a holes. So, I introduced the concept of hole, absence\nof electrons, ok. These are things we had studied initially, then we came about density\nof states to tell us how electrons and holes will populate the number of states that are\nthere, also it depends on fermi distribution, fermi dirac statistics. And from there, we\nwent to how to calculate carrier, n and p carrier concentration. Those we have discussed\nhow to calculate carrier concentration, what is doping, right. We have done that and what\nare the other things we have done in the course till now. We have done about how temperature dependence\nof carrier concentration, temperature dependence of carrier concentration, n and p. I have\ntalked about high doping effects right, high doping effects, talked about incomplete ionization\nwhich is very important by the way; incomplete ionization by the way in high doping effects.\nWe have discussed about band gap narrowing, you know band gap can shrink in high doping\neffect, there will be band tails, we have discussed about things and how you applied\nJoyce-Dixon approximation to calculate charge density and so on. These are the things that\nwe have studied. Now, what is the next point in the agenda?\nThe next point in the agenda will be to introduce mobility, mobility of carriers ok. Mobility\nof carriers, low field transport, ok, low field transport and after that, will introduce\nhigh field transport, high field transport and velocity, carrier velocity. So, low field\ntransport, high field transport will come along with that, what will come is drift and\ndiffusion, drift and diffusion of carriers will come. So, that we can understand electron\nor current, you know current flow. We can discuss current flow. This transport, how\nelectrons and holes are transporting depends on the transport drift and diffusion, they\ndepend on velocity, they depend on mobility right, current will flow and once we discuss\nabout current flow before that also we have to discuss about carrier recombination and\ndecay. how carriers decay. Why they decay? We will talk about that carrier recombination\nand decay, and then will talk about continuity equation continuity equation.\nSo, this is the cycle that will complete in the next perhaps 2 or 3 lectures. We have\nto complete this mobility of carriers, low field transport high field transport, drift\ndiffusion, current flow, then recombination carrier decay, continuity equation. Now after\nthat, we are ready to go to p-n junction and devices. So, that is the agenda here. So,\nwe will wrap up the class here today and in next class we will again look at will start\nfrom mobility of carriers . So, will end the class with the note that we have done high\nfield transport and incomplete ionization. Today we are good we are confident and familiar\nwith carrier statistics, how to calculate electron and hole concentration. Now we shall\nstart to study mobility and low field transport from next class, ok. You might have heard\nthe word electron mobility a lot ok. We will understand what the electron mobility actually\nmeans ok. So, we will end the class here. Thank you for your time."}, "h0Y9jDKqScQ": {"video_id": "h0Y9jDKqScQ", "title": "DigbijoyIntro", "transcript": "Hello all. My name is Digbijoy from Center\nfor Nano Science at Indian Institute of Science, Bangalore. So this course, Fundamentals of\nSemiconductor Devices which I will be offering now is actually a course that will introduce\nyou to the basics of semiconductor and semiconductor devices. What are the benefits of doing this course?\nYou will learn right from the very basics of electron holes to designing devices. You\nwill, you will learn everything that you need to know to understand semiconductor devices. You might be aware that most of the electronic\nthings that you see around you, you know laptops, computers or cell phones, anything, they are\nall build of things like transistors, diodes, you know many of the laser diodes, L E Ds,\nsolar cells these are all semiconductor devices and in many cases we are not very familiar\nas to how these devices are working. Although we do make circuits, analog and digital\ncircuits but we do not understand exactly how semiconductor devices are working. So\nthis course will build you the base for understanding semiconductor from the very fundamental, you\nknow level. And after you do the course, you will be confident\nin understanding and analyzing any kind of semiconductor, electrical or optoelectronic\ndevices including compound semiconductor-based devices, silicon-based devices, optical devices\nlike L E Ds, solar cell, photo detectors, photo sensors and so on besides the conventional\ndevices, Ok. And we will start with the assumption that\nyou only have studied physics till 10 plus 2. You do not have to understand anything\nbeyond that. So we will start from there and over the next\n30 lectures that are there in this course, we will, step by step, each of this device\nconcept, the fundamental of semiconductor so that you are able to score very well in\nsemiconductor related courses or entrance exam papers like GATE or other exams. At the same time, you would be also inclined\nto take up career as a researcher in semiconductor either in academy or industry or take up higher\nstudies because the world today needs fundamental breakthroughs in semiconductor technologies\nfor the next generation electronics and photonics. So this course will train you for that. This\ncourse will train your thinking for that and the concepts below that will all be highlighted\nand elucidated very clearly, Ok. So Fundamentals of Semiconductor Devices will,\nalthough the topics will be very similar to what many other courses offer, the treatment\nof this course will be at fundamental level and we will go very slow so that you understand\nall the concepts very easily as we move forward, Ok. So I welcome you to register and get signed\nup for this course of semiconductor devices. My email id will be available, so if you have\nany questions, any doubts, any things you want to clarify you are always welcome to\nemail me at my email id is digbijoy at the rate i i s c dot a c dot in. And I hope you will enjoy the course and we\nwill have a very interactive session as we begin this 30 hour journey to start from basics\nof semiconductors to semiconductor devices. Thank you"}}