{"6qS83wD29PY": {"video_id": "6qS83wD29PY", "title": "2-Minute Neuroscience: The Neuron", "transcript": "Welcome to 2 minute neuroscience, where I\nsimplistically explain neuroscience topics in 2 minutes or less. In this installment I will discuss the neuron. This is a brain. Estimates vary but right now the best guess\nseems to be that our brains contain around 85 billion neurons. The neuron is a nerve cell and is the primary\nfunctional unit of the nervous system. This is a generic image of a neuron. Neurons actually come in all shapes and sizes\nbut this is the prototypical version of a neuron that you’ll often see in a textbook. The structures extending from the left side\nof a neuron that look a little bit like tree branches are called dendrites. Dendrites are the area where neurons receive\nmost of their information. There are receptors on dendrites that are\ndesigned to pick up signals from other neurons that come in the form of chemicals called\nneurotransmitters. Those signals picked up by dendrites cause\nelectrical changes in a neuron that are interpreted in an area called the soma or the cell body. The soma contains the nucleus, which contains\nthe DNA or genetic material of the cell. The soma takes all the information from the\ndendrites and puts it together in an area called the axon hillock. If the signal coming from the dendrites is\nstrong enough then a signal is sent to the next part of the neuron, which is called the\naxon. At this point the signal is called an action\npotential. The action potential travels down the axon,\nwhich is covered with myelin, an insulatory material that helps to prevent the signal\nfrom degrading. The last step for the action potential is\nthe axon terminals, also known as synaptic buttons. When the signal reaches the axon terminals\nit can cause the release of neurotransmitter. These purple structures represent the dendrites\nof another neuron. When a neurotransmitter is released from axon\nterminals, it interacts with receptors on the dendrites of the next neuron, and then\nthe process repeats with the next neuron."}}