{"wWwr0tDSqnE": {"video_id": "wWwr0tDSqnE", "title": "Demo: Hello World | Python for Beginners [6 of 44]", "transcript": ">> So, Christopher has\nshown you how to get Visual Studio Code working\nwith the Python extension, now let's go into\nVisual Studio Code and actually start trying\nout some of our code. Now, when you work inside\nVisual Studio Code, you're going to need to create\na folder on your file system first, and that's a place where you can keep all your files together\nthat you're working on. So I've already gone ahead\nand I've created a folder. So as soon as I open\nup Visual Studio Code, I'm going to want to\ngo to \"File,\" \"Open folder,\" and open up that folder\nthat I've precreated. So I've already created a folder called Intro to\nPython development, I'm going to open that folder now, and now that gives me a place to store all the files I'm\ngoing to be working on. Once I've got that folder\nopen and I can see the folder name listed\nover here on the left, then I can say \"New file\" to create a new Python file\ninside that folder. So now, I can try out\nthat print statement. So we say, ''Print, Hello world.\" Now, initially, there's no way that Visual Studio Code can tell that what I've written is a Python module. So it's when I save the file that I tell Visual\nStudio it's Python. So I'll just save it\nby going to ''File,\" \"Save,\" or Control S if you\nlike keyboard shortcuts, and once it's saved, I'm going to make sure I\ncall it Helloworld.py, and that PY extension is a cue to Visual Studio Code that I've\njust created a Python script. You'll see right away\nsome colors appearing. That's a good sign because\nit's actually using code highlighting to indicate that the hello world is the string\nby showing up in red and so on. So I can tell now that Visual Studio Code recognizes\nthis as a Python script. Then I want to run that. So to run that code, and this will be\nyour ultimate test of whether you got all your Python\ninstalled correctly, you just type \"Python\" and\nthen the name of your script, and I called mine Helloworld.py. If you forget your file name, don't worry, it's at\nthe top of the tab, and then you hit \"Return\"\nand sure enough, there's Hello world\ndisplayed on the screen. So I've successfully run\nmy first script in Python. As I mentioned, you can put single quotes or double quotes\naround your string. I'm just going to use Control S\nto save that file again, go back to \"Command\nline,\" I'm going to use the up arrow which allows me to\ngo to the previously run command, and rerun my script, but this time with double quotes\naround the string, and sure enough, still\ndisplays Hello world. So as I mentioned, single quotes, double quotes, either\none will work just fine. Now what if I want\nsomeone to input a value? Well, I could create\na variable called Name, and say \"Input, what is your name?\" Then I can say hello, and then maybe after I say hello, I say let's print\nthe name on the screen. So let's say hello to the person\nwho has typed in their name. So now, save that. Go to my code, rerun that, and it says, \"What is my name?\" My name is Susan, and now I see \"Hello Susan\"\nappearing in the output. So the input command I said is a way for me to ask\nfor input from a user, and then I can take that input and store it back inside a variable. Once you start having multiple lines of output displaying on the screen, you may want those blank lines. So at anytime you can do\nsomething like \"Print, hello,\" and then I\ncan just say \"Print, world,\" and you will notice\nthose appear on different lines, so you can see hello world\nappear in different lines. I'm going to show you\nanother useful little command in Visual Studio Code here, we're starting to get to the bottom\nof the command line output. So it just typing the word\n\"CLS,\" we'll clear the screen and take us back to\nthe top of this output here. Useful little thing when you've got a lot of outputs\ndisplaying on the screen. Another way of putting output over multiple lines\nis you can use that slash n. Slash n is\nan escape character that means, please insert a new line. So that will also display a line\nof code over two lines of output. So slash n is a way of saying\nnew line, right inside a string. This is really handy when used when displaying output to use\non a console application, but as I mentioned,\nprint is also very popular for coders trying\nto debug their code. So if I was writing some code\nthat was doing some math, x equals 532 plus 12, and then I say y\nequals x divided by 0, now I know that dividing by 0\nis going to cause an error, and then I say \"Print, yay I did math.\" So I write a very simple\nlittle program here, and I save it, and I go down, and I run that program, and it blows up. Now, I'm using\na very simplified example. You can probably look at my code and guess which line\nof code blowed up. It's the divide by 0. But what if this was inside a 500, 600 line program with\nmultiple modules and functions, sometimes it'd be trough to track down where that line is blowing up, even though in the error message it does give you a line number\nwhich gives you a hint. So sometimes when I'm\ntrying to debug my code, I will literally write things like saying ''Adding numbers,'' sorry, promised I would use\nsingle quotes here, 'Adding numbers', and\nthen I add my numbers, and then I'll say print, 'dividing numbers,' and then\nI will divide the numbers, and then I have\nmy print statement saying, 'Yey I did math.' That way, when I go\nand I run my code, you can see that the adding\nnumbers message appeared, the dividing numbers\nmessage appeared, and then I got an error message. So it can help me flow back through my code to figure out\nwhat code executed successfully, and whichever print statement\nI didn't see is probably the one right\nafter the line that failed. So don't be afraid to use print\nstatements as a debugging tool, as you're learning to code."}, "JA3sCmrv11M": {"video_id": "JA3sCmrv11M", "title": "Introduction to semiconductors", "transcript": "Welcome everyone my name is Digbijoy. And today we shall begin this new course Fundamentals\nof Semiconductor Devices. It will be a 30 hour long course. I will be recording lectures for you; I will\nbe taking this course. Many of you might have read about or studied\nabout semiconductor devices, but this course will be a little bit different in the sense\nthat we shall try to correlate semiconductor devices with practical real life applications. We will make it less mathematical, I mean\nthey has to be mathematics, but it will not be very complicated course. We will try to make sure that there is no\nprerequisite. So, even if you have passed your 12th board\nexams, you should be able to understand the concept of this course with the basic that\nyou have learned. It will also have elements for people who\nare doing post graduate or PhD, there will be sufficient concepts for thoughts, but the\nidea of this course is to train you and train you to learn how to analyze and understand\nsemiconductor devices, because it is a very important aspect or branch of electronics,\nphysics, material science and so on. In many institutes of this country, semiconductor\ncourses are thought, but you know the practical correlation with devices and many of the fundamentals\nare probably not in covered in very great details. So, we will try to do that here ok. Now, today is the first introductory class,\nfor so 1 hour we shall discuss about what is semiconductor, where are semiconductors\nused, what are the types of semiconductor and introduced very basic concepts of semiconductor\nbands ok. Even if you have not heard about these words\nlike bands and band diagram, you should not be worried. We shall go very slow, we make sure that you\nunderstand each and everything that we discuss here ok. So, semiconductor devices are everywhere the\nvery reason you are able to see me and I am able to talk to you is because use of semiconductor\ndevices. You are very well aware that all our cell\nphones, mobiles, laptop, ThinkPad’s, everything we have processors, memory devices, logic\ndevices, they are all made of semiconductor devices by the way right. So, the transistor which revolutionized our\nelectronics industry that transistor is one of the most important semiconductor devices\nthat was invented and that has eventually triggered the IC revolution, the integrated\ncircuit revolution. In the last 50-60 years you are very aware\nthat the integrated circuit revolution has accelerated the progress of mankind faster\nthan probably anywhere else in the history ok. It is incredible the things that are shaping\nup and you may not be aware that semiconductor devices are used in. So, many other applications outside of mobile\ncell phones and laptops just so many other applications which you may not be aware ok. For example, your electric vehicles that are\nstarting to populate the roads increasingly, you know there are semiconductor devices to\nenable charging of these vehicles. You have to convert power; you have to convert\npower from say kilowatt to watt or watt to kilowatt ok. All your high speed application like radars\nand satellite transmission communication also need transistors that can operate at very\nhigh speed and very high power. You know semiconductor devices are also used\nfor optical devices. All the white light LEDs that you are using\nnow to light up, the street, the stadiums, the houses everything that white light LED\nis a semiconductor device. Solar cells are semiconductors. Photo detectors and photo sensors are also\nsemiconductors mostly. There are varieties of semiconductor devices\nthat are revolutionizing our lives ok. So, it is very important for us to understand\nhow the semiconductor devices work, what is semiconductor and so on. You might know of course, semiconductor is\nsomething that has a conductivity between metal and insulator, but that is not enough,\nwe shall go more deeper into the concepts of semiconductor ok. So, I will start using white board or writing\ninstead of slides, so that we can actually get the ideal very closely. So, the word semiconductor and you know I\nwill use different color maybe semiconductor ok. Conductor is what conducts electricity very\nwell like metals right; and insulators are like wood and glass which cannot carry electricity\nso much. But the word semi conductor this word semiconductor\nmeans those materials whose conductivity can be tuned or tailored you know that probably\nmost of you know. You see if you have a piece of metal it is\nvery difficult to change the conductivity, I mean you can raise the temperature that\nis different, but at room temperature for example, if you shine light or do anything\nelse, it is very difficult to change the conductivity. Or if you take a piece of glass for example,\nit will not conduct electricity no matter what you do, it is very difficult right. So, there are these materials call semiconductors\nwhere you can change the conductivity. All of you know what is conductivity? You know resistance right, resistance follows\nthe ohms law typically V by I. So, conductivity is sort of the reciprocal\nof resistance or resistivity. So, you know how much current a material can\nconduct is a measure that connectivity measures that quantity. And semiconductors that is unique materials\nwhose conductivity can be tuned by many many orders of magnitude and that is there beauty. Because of that property you can make devices\nthat can cater to your needs ok. You can use semiconductor as a switch, you\ncan use it as a switch electrical switch ok. You can use it as an amplifier. What does a switch do? A switch will basically it will it will have\nan on state. So, it will let current go in some condition;\nit is a off state, so it will block the voltage and not allow current to go in another state,\nthat unique property cannot be there in metal. You cannot make metal go into off state. A metal will not be able to block voltage\nright. If you apply 100 volt or 200 volt and you\nexpect you know pico amps of current, it will not happen right. Or a glass you cannot expect a very high current\nampere or milli ampere to flow at very low voltage, it will break down at very high voltage\nby the way. So, only semiconductors have that unique property\nthat it can both allow very high current to flow, it can also block very large voltages\nlike insulators, so that is the beauty of semiconductor that we can use as a switch. And that has so many applications you know\nthat has so many applications that I will come. Then you can use it is an amplifier. What amplifier does is that? It amplifies, it enlarges the signal ok, and\nthat has a gain; and that gain can be used in many RF devices for example, right. It can be used as a logic device right. As a logic device your CMOS logic as a memory\ndevice, you can use it is as for memory right where to store information, there are so many\nthings you see. You can use it as an LED that emits light. You can also use it as a laser diode right\nin a laser pointer for example, and so many other uses. It you can use it as a solar cell; you can\nuse it is a photo detector; all these devices are actually influencing and revolutionizing\nour lives. And these are enabling the larger industry\nthe electronic industry for example is heavily dependent semiconductor devices right. So, this course will be basically understanding\nhow does different devices work. And what is what are the basics of semiconductor\nand will never lose side of two things one is that the concepts have to be simple so\nthat we all understand what we are talking about. The concepts have to be simple and explain\nwith, the second point is that they have to we have to explain all the concepts with practical\nexamples and you know practical correlations so that we know with the world that we are\nliving in how this devices relate ok that is very important. So, this is broadly the outline of the course. We have different themes, different topics\nwithin semiconductors that we will cover right, many devices that we will cover and basics\nof semiconductor that we will cover here. So, let me change the pages. So, we will have 30 lectures. So, today is the first lecture right. We will have 31 hour lectures. And we shall we shall study devices, the second\nyou know the broadly if I split the course into 2 halfs. And here I will the first half of this whole\ncourse you know will be basics. So, in basics we will discuss about the basics\nof band, you know there is something call band and band diagram. If we are not familiar with this terms do\nnot worry we shall definitely understand very clearly what band diagrams mean. And you know the moment you understand band\ndiagram, you can understand devices. The Nobel laureate Herbert Kroemer, he got\na Nobel Prize in 2000 for you know developing hetero junction and optoelectronic devices. He says that if you cannot draw band diagram\nfor a semiconductor device, it means that you do not understand semiconductor device. So, the moment you understand band diagram,\nwe can understand semiconductor devices very well ok. And so, we shall introduced the concept of\nelectrons which you know and holes which might be a new concept to you ok. We will introduce concepts of doping. What is doping? Doping is basically the ability that the process\nof changing the conductivity of a material right by introducing some impurities. We will introduce the concept of doping. We will introduce the concept of some statistics\nagain not too much mathematics, but very basics. Why do you need statistics, it is actually\ncall of Fermi-Dirac statistics. Let us not get scared about the word here. The Fermi-Dirac statistics basically is a\ntype of statistics that will help us explain the semiconductor you know how electrons are\nthere in semiconductor, how current flows and so on, so many other things will be discuss\nthere. We will also discuss about transport, the\ncurrent transport in semiconductor, eventually semiconductor devices have to carry current. All the processors and logic devices in your\ncell phones or laptops, they have to carry current, small current in their circuits. So, how do current flow, that transport we\nshall discuss. There are different ways of transport in you\nknow way in the current transport happen. And also that depends on something called\nhow carriers recombine they something called carrier recombination. We should not worry so much about it right\nnow. But how carriers will recombine, we will discuss\nthat right. And we shall introduce the most common thing\nthat we always learn which is p-n junction. I am sure you have heard about or read about\np-n junction in even in your class 12 or 12 standard boards very briefly. So, we shall go to the p-n junction. And pretty much that will be your basics you\nknow there will be some other things I am not writing it down here, but more or less\nthis will be how your basics will come up ok. And the device we shall definitely study MOS\nand MOSFET right. MOSFET devices are the most common devices\nthat are used in electronics. Nowadays of course, there very highly scaled\nok that is a different things. We shall also study about BJT; it is a bipolar\njunction transistor. It is a different type of transistor that\nwe use. And we shall study very briefly about solar\ncell which has to be there, you know our Indian government is spending so much on solar cell. We need to know what, how solar cells work. We will also study about LEDs and photo detectors\nvery briefly one one lectures probably each right. And we shall study about transistors for and\ndiodes for different applications ok, transistors and diodes, how are they engineered, how are\nthey tailored for say high speed applications or maybe for high power applications right,\nor may be for low noise applications right. So, many applications are there may be for\nmemory and logic right. So, how are transistors decided or designed\nor tuned in order to cater to this different needs separately. We shall also go through them ok, and that\nwill be the basically the summary of the course that we have. The many new things that we will come across\nhere, many things that we may not have heard before, but we shall definitely start as if\nwe do not know anything and we will start from there ok, we will start from there. So, the most important thing in semiconductor\ndevices you know I keep telling that semiconductor devices have revolutionized our lives. And our semiconductor devices have evolved\nyou know from if I look at 1948 is when the first transistor probably you know BJT was\ninvented at Bell labs in US it is you know. And from 1948 to 2018 now, sorry 2018 now\nthings have changed immensely. Now, you have hand held Smartphone’s, I\nmean it can do crazy things right. So, this evolution has happened over so many\nyears right. And if you take any chip, if you take any\nchip, there many transistors in a chip that do they work right. The number of transistors in a chip they double,\nthey become two times almost every one and half years ok. The number of transistors in a chip double\nevery roughly every one and half years and that is called Moore’s law, because a person\ncalled Moore have observed this and predicted this long back in 1960s and 70s that you know\nevery two years, the number of transistors is doubling. What is means is that transistors are becoming\nsmaller their shrinking the sizes and that is why we are able to accommodate more and\nmore transistors in the same chip. So, the number of transistors is doubling\nevery one and half years. And secondly, when you can pack more and more\ntransistors in each of this chip, then the complexities and functionalities also become\nlarge. So, you can do more and more sophisticated\nwork a computer in 1980 was not as advanced as in 1995 for example. And in 2004 laptop was sufficiently more advanced. And now in 2018, for example, a Smartphone\nis much more smarter and sophisticated, then a laptop of 1990 or you know 2005 for example. So, this is the evolution of transistor that\nhappened over a large amount of time in over the last 60, 70 years. And transistor is not the only device of course,\nthere are diodes and detectors and so many other things, but transistor is one of the\nmost fundamental building blocks of all our circuits right. And transistor is a semiconductor device that\nwe shall come about. We shall discuss transistor in details, but\nin very brief a transistor is a device where the current flowing between two terminal A\nand B is not decided by the voltage that you applying between A and B, but by the voltage\nyou applying at another point C, so that means, the voltage that you apply at point C can\ncontrol how much current is flowing between A and B. So, it can be used as a switch it\ncan be used as an amplifier and so many other things right that is a transistor in essence. Now, this is evolution of transistor and you\nknow and 2018, the transistor sizes have become so so small that you need super powerful electronic\nmicroscope actually to see them. And you need very advanced nanofabrication\ntechnologies to fabricate such transistors ok. When we you know about the company Intel right,\nIntel is one of the leading companies that make this microprocessors and chips right. And Intel of course, the Samsung and all though\nSamsung has this consumer electronic product like you know cell phones, washing machine\nand TVs and what not, but Samsung also has a lot of you know technologies and facilities\nfor very highly scaled and very sophisticated chip design and transistor technology. So, this company is for example, Intel, Samsung\nand there are many others like global foundery and so on, they report the development of\ntechnology like say 14 nanometer technology or 14 nanometer node they call it. It does not necessarily mean the transistor\nis 14 nanometer, but you can say that you know the smallest feature you know that the\nspacing between two lines adjacent lines could be as small as 14 nanometer. Many things are there we will come to that\nin later classes, but you know 14 nanometer is so small. Can you get a feel of what 14 nanometer is? 14 nanometer is you know 1 nanometer is basically\n1000 times of 1 micron right, 1 micron. And you know 1 micron is basically itself\n1000 times 1000 times smaller than 1 millimeter. So if you take a ruler, you know if you take\na school ruler that you have, you have this 1 millimeters gaps right, 1 millimeter gap. If you divide that 1 millimeter gap into 1\nmillion times right, then you get 1 nanometer. So, it is very, very small, you cannot see\nit with eye ok, so that transistor has evolved from 1948 to 2018. Now, we are talking about such small dimensions\nand so many complex functionalities are there in a cell phone. So, many other areas like you know electric\nvehicles and radars, satellites also used transistors that we shall learn in this course. But so it is high time we start learning how\nsemiconductor devices are realized, and what we need to know in this course ok. So, the most important concept of semiconductor\ndevices or semiconductor is called bands. And these are energy bands actually, these\nare energy bands. Now, what are energy bands actually? Very simplistically speaking if you take any\nsemiconductor you know what are the common examples of semiconductors do you know silicon,\nsilicon is a of course, an element right it is a very the most widely used and the most\ncommonly used semiconductor by the way. You have Germanium that is also another semiconductor\nright. Some forms of Carbon also can be semiconductor\nfor example. These are elemental semiconductor because\nthis is only one material that is Silicon; this is one material that is Germanium. You can also mix two for example, you have\nGallium which is a metal, and then you have arsenic right, and you mix them together right\nand you get gallium arsenide right that is a compound. Its formula is Ga-As gallium arsenide right. This is a compound semiconductor why because\nthere are two two elements are there, this is a compound semiconductor. These are elemental semiconductors right. And all these semiconductors are characterized\nby something called energy bands ok. The moment we understand energy bands, many\nof the things will become clear right. So, in very very simple language, you know\nyou have in any and when you take silicon for example, or germanium or some other materials\nfor example, you have an energy band which is fully filled with electrons. And then there is another band which is empty\nor mildly filled ok, it is empty ok. And there is what is this y-axis? By the way, this is energy actually you know\nenergy; and what is this x-axis by the way this is distance in centimeter or meter. So, I can draw even longer which means it\nis much longer you know I am talking about diode or something. So, it is actually distance. So, I am talking about distance and this is\nenergy. There are bands there are bands one band is\nfully filled, and one band is sort of empty mostly empty or maybe there will be few carriers\nhere ok. Now, when I say fill, they are filled with\nelectrons right. Now, of course, the question that we have\nto ask is what are these bands and where have they come from, you cannot magically say that\nsilicon you know silicon has this bands. Why are these bands coming from? To understand that you have to go to you know\nthe fundamental each atom each element for example, you know that there are this k shell,\nL shell and then electrons that you studied in your high school physics and chemistry\nremember, we have to bring that picture into account to actually explain the bands eventually. So, let us take a much simpler example right. So, let us take for example, carbon you know\ncarbon has how many electrons, its formula is 1s 2 2 s 2 2 p 2 sorry right sorry 2 p\n2. So, it has 6, out of 6 electrons in total\nright. I am sure that you have learned this representation\n1 s 2 2 s 2 2 p 6 is taught in high school and higher secondary you know 10, plus 12,\nplus 12 chemistry and physics I am sure you have learned this and the understanding is\nthat you have you know this representation and that is why we are able to understand\nthis course ok. So, we have to know this we assume that you\nknow this thing, so 1 s 2 2 s 2 2 p 2 that is the representation of carbon. What does it mean? It means that you have this different shells\nknow. So, in 1 =s you know 2 electron right, you\nhave 2 electron. Then in 2s, you have 2 more electron right;\nand then 2p you have two more electron. Now, you know in 1s there are only 2 states\navailable and both are occupied by electron. In 2 states, there are 2 states in 2s, and\nboth are occupied by electron. In 2p, there are 6 states available. If you remember p or del can accommodate 6\nstates, 6 electrons, but there are only two available here ok. So, there are something that is empty ok,\nthat is for one single carbon atom right, one single carbon atom. What are we trying to do; we are trying to\nunderstand how these bands form. I told you right in semiconductor we talk\nabout some bands one when is fully filled of electrons and one band is empty. There is an energy difference between these\ntwo ok. And once we understand this concept we basically\nmove ahead we understand the semiconductor devices or concepts. So, where are these bands coming from that\nis what we are trying to understand, let us not lose track of our site. So, we want to understand how. This is only one single carbon atom, but do\nyou think a semiconductor has only one single atom, no. A semiconductor has the trillions and trillions\nof Avogadro’s numbers of atoms right, I mean it is not one single atom. So, you have one carbon atom for example,\none isolated carbon atom, you get this picture. There is another isolated carbon atom very\nfar away, you get this picture. There is another isolated carbon atom very\nfar away you get this picture and so on and so forth right. In three-dimensional, you can have lot of\ncarbon atoms they are very far from each other. So, there is no problem each of them have\nthis sort of representation. Now, in actual crystal, if you take a piece\nof carbon in graphite or something like that right, if you take an actual piece of carbon,\nthe carbon atoms are actually not so far apart right, they are separated by a fixed spacing\nyou know. There are so many carbon atoms there are so\nmany carbon atoms that are equally spaced in all directions in three dimensions right. I am only drawing here in two dimension because\nthis is a whiteboard of two dimension, but you have z, x, y, in all three dimensions\nyou will have depth and this is a fixed distance by the way. This distance is fixed for each material. The spacing between two the spacing between\ntwo nearby atoms; this is a carbon atoms right. This is called lattice constant. Please remember that ok lattice constant. This is a lattice of atoms actually; this\nis a lattice of atoms. And the spacing between two nearby atoms is\ncalled lattice constant. And this is a fixed number at room temperature\nfor each material right, it is a fixed material for each material it’s a fixed number. Why I am I telling all these, again the eventual\nidea is to understand how bands are formed and what are the bands? Now, I told you that for each individual carbon\natom this is the picture that we have. But I will take a different color may be here. So, let us consider one carbon atom here,\nanother carbon atom very far away, they do not interact with each other ok. There is no problem. Each of them has his own set of orbitals,\nshells, valence orbital’s and everything is there, everything is fine and nice. But this is not the actual distance of carbon\nto carbon atom in a crystal. In a crystal this is much shorter. So, let us now imagine that we are trying\nto bring these carbon atoms close to each other. So, it was here, it was here, but I am bringing\nthem close sorry, so maybe I have a carbon atom here and I have a carbon atom here. So, I have pushed them I am bringing them\ncloser. Why, because eventually the carbon atom has\nto be very close very close as it is a fixed number its some angstrom the level is strong. Actually the carbon atoms have to be close\nto each other in reality. In a real carbon crystal, it is a few angstrom\nok. You know what is Angstrom, 1 angstrom, sorry,\n1 angstrom is 0.1 nanometer, few angstrom is the spacing between 2 carbon atoms that\nis in real crystal. So, I am trying to bring together 2 carbon\natoms, what will happen each carbon atom as its own shells orbitals know it as its own\n1 s 1 s 2 2 s 2 2 p 6 everything is there know. The moment you try to bring them close, the\nmoment you try to as you try to bring them close, this atoms will interact with each\nother. What will happen is that you had this discrete\nenergy levels remember. When I say discrete energy levels, what do\nI mean I mean the levels like 1s you know 2s 2p, these are discrete energy levels fixed,\nfixed energy levels. This discrete energy levels, they will try\nto interact as they are coming closer you know because a real crystal of carbon or silicon\nfor that matter has so many atoms that are closely packed with each other I mean real\ncrystal is real crystal. So, this discrete energy levels will start\nreact you know interacting with each other. And what will happen is that each discrete\nenergy level that discrete energy level which is very sharp will start splitting will start\nsplitting into band. What does it mean is that one energy level\nlike this will become like a band like this, because the atoms are coming closer and there\nvalence orbitals are now interacting with each other right, and that’s why one discrete\nenergy level will now split up. So, how do I, write it more clearly? So, for example, on the x-axis I am plotting\ndistance r, I am plotting distance; on the y-axis, I am plotting energy. So, far away I have see I will not talk about\n1s 2 because the in carbon 1 s 2 is the inner most orbital know. And that inner most orbital exchange do not\ntake part in that interaction so much. And inner most inner most electrons also do\nnot contributed is you know energy band gap formation so much. We will come to that. So, we will only talk about 2 s 2 and 2 p\n2 2 p 2. So, I have a level which is 2 s 2 which is\na sharp discrete level, when r is far away ok. So, this is r, r is large the atoms are very\nlarge and far apart from each other, so these are discrete level that is there. And then you have a discrete level 2p2 which\nis also one single level discrete level ok. Now, you are bringing them close and close,\nso r is reducing. What will happen is that this energy level\nwill now start to split like this ok. This energy level also will try to split like\nthis. Why are they splitting, because they are interacting\nnow. And because they are interacting the levels\nare splitting into a continuum of bands this is called a continuum of states. Actually when I say band there are many small\ndiscrete states that are formed like this. It is called a continuum a continuum of discrete\nlevels which appear they appear as a band ok, they appear as a band. These are discrete levels that are so much\nin number that the whole thing appears like a band an energy band that’s why I am talking\nit is a band; it is not a discrete level. So, this is splitting up here ok. This is splitting up here. And this they will merge for example, ok,\nthey will merge here ok. And then again they will go something like\nthis here. So, I will tell you these are what is happening\nhere is that these are filled I mean these are not filled, I mean these are merge states\nthat are forming. These are merge states that are forming. So, you see in 2s2, there are two states and\nthere are 2 electrons you agree. So, if I take if I take large number of atoms\nsay n atoms, there will be 2 N states and 2 N electrons. Do you agree? N is a large number, in p you have 6 N states. If I have N atoms, I have only 2 N electrons. So, in this part now as just splitting the\nbands is splitting right, this part you see this is by the way r is decreasing ok, r is\ndecreasing, your distance is decreasing. What does it mean, it means the atoms are\ncoming closer and closer ok. In this part, this energy states have merged. And what is the total number of available\nstates now 6 N plus 2 N 8 N states are now available, energy states are available. And how many electrons are their 2 N here,\n2 N here, so 4 N electrons available. And there are 8 N states. Are you getting my point? I am talking N is a large number of electrons,\nlarge number of atoms sorry ok. Many carbon atoms are coming together and\nthese are carbon atoms coming together at far away they are discrete levels you are\nright you have learned in your high school and 10, plus 2 physics and chemistry. But as you are bringing them close and close\nthe energy levels are splitting into continuum of levels which look like bands. And these bands will merge. They form this particular you know merged\nbands, and then again they spit up here, because it is actually continuing right this actually\ncontinuing like this, this actually continuing like that ok. So, what happens is that what happens is that\nthis part now this 8 N states will split up is 4 N states here and 4 N states here. This 8 N here know there were 8 N here, they\nsplit up as 4 N and 4 N. And because there are only 4 N electrons, this 4 N electrons\nwill occupy this. So, there will be 4 N electrons here and this\nwill be empty completely, there are no electrons their right. And you see this is this point this distance\nwe say r equilibrium, this is the equilibrium spacing between the atoms in a carbon atom\nwhich what it means is that in a real carbon crystal like graphite this is actually the\ndistance at which the atoms exists distance with respect to each other. And at that point you see there is a gap here,\nthis is a gap know this is completely empty. As I told you four N states are empty and\nthis is 4 N states are filled they are separated by a gap this is called energy gap and we\ncall it energy band gap ok. We call it energy band gap ok, that is how\nenergy band gaps are formed in semi conductor. I can that was a energy verses distance in\na in a splitting of a diagram, but actually what it happens is that I can say that this\nis one fully filled band, this is fully filled band, it is full of electrons it is full of\nelectrons. And then there is a band sorry which is empty\nwhich is empty. This is electrons here; this empty here; it\nis a gap here. This gap is called the energy band gap. And energy band gap is symbol by EG, this\nis energy band gap. So, thank you for your time. We will meet in the next class."}}