{"6qS83wD29PY": {"video_id": "6qS83wD29PY", "title": "2-Minute Neuroscience: The Neuron", "transcript": "Welcome to 2 minute neuroscience, where I\nsimplistically explain neuroscience topics in 2 minutes or less. In this installment I will discuss the neuron. This is a brain. Estimates vary but right now the best guess\nseems to be that our brains contain around 85 billion neurons. The neuron is a nerve cell and is the primary\nfunctional unit of the nervous system. This is a generic image of a neuron. Neurons actually come in all shapes and sizes\nbut this is the prototypical version of a neuron that you’ll often see in a textbook. The structures extending from the left side\nof a neuron that look a little bit like tree branches are called dendrites. Dendrites are the area where neurons receive\nmost of their information. There are receptors on dendrites that are\ndesigned to pick up signals from other neurons that come in the form of chemicals called\nneurotransmitters. Those signals picked up by dendrites cause\nelectrical changes in a neuron that are interpreted in an area called the soma or the cell body. The soma contains the nucleus, which contains\nthe DNA or genetic material of the cell. The soma takes all the information from the\ndendrites and puts it together in an area called the axon hillock. If the signal coming from the dendrites is\nstrong enough then a signal is sent to the next part of the neuron, which is called the\naxon. At this point the signal is called an action\npotential. The action potential travels down the axon,\nwhich is covered with myelin, an insulatory material that helps to prevent the signal\nfrom degrading. The last step for the action potential is\nthe axon terminals, also known as synaptic buttons. When the signal reaches the axon terminals\nit can cause the release of neurotransmitter. These purple structures represent the dendrites\nof another neuron. When a neurotransmitter is released from axon\nterminals, it interacts with receptors on the dendrites of the next neuron, and then\nthe process repeats with the next neuron."}, "5p9ucgRDie8": {"video_id": "5p9ucgRDie8", "title": "10-Minute Neuroscience: Neurons", "transcript": "Hi everyone, welcome to 10 minute \nneuroscience. In this installment,   I’ll be talking about neurons, the fundamental \nunits of the nervous system. I’ll cover their   basic structure and function and then I’ll \ntalk about some ways we can categorize neurons. Neurons have some unique functions that form the \nbasis for the powerful information processing   capabilities of the nervous system. They’re \nspecialized for transmitting and receiving   information, and they can communicate with one \nanother as well as with cells in other types of   tissues (like muscles or glands). They can also \ncarry information (such as sensory information)   from the rest of the body to the brain. Something \nelse worth noting about neurons is that there are   a lot of them. Current estimates suggest there's \nabout 86 billion neurons in a typical human brain,   and those neurons create a very complex circuitry \nas each neuron forms many connections—usually   thousands of connections—with other neurons. \nThis creates anywhere from hundreds of trillions   to maybe more than a quadrillion areas in a human \nbrain where neurons communicate with one another. So if you look at a neuroscience textbook, \nyou’ll see an image of a neuron that looks   something like this, and this is what we’ll \nuse for our discussion of the neuron today.   But it’s important to note that neurons \ncome in all shapes and sizes—there are   over 1000 different types—and most of them \ndon’t look just like this one–so you can   see here some examples of different types of \nneurons found throughout the nervous system.   They look quite different, but they're all \nvariations on a theme, and most of them have   the same general components—those general \ncomponents are what we’ll focus on today. Before we get into those components let me just \nsay something about how neurons communicate,   because it will make the anatomy we’ll talk about \nnext easier to understand. I’ll have other videos   that cover these topics more in-depth but \nI’ll just provide a quick summary here.   Most neurons use electrical and chemical \nsignals to send messages throughout the   brain. The main type of electrical signals are \ncalled action potentials; they’re created when   charged particles called ions flow into neurons \nand generate an electrical impulse that can travel   from one end of a neuron to another. These \naction potentials can cause the release of   chemical signals called neurotransmitters, \nand neurotransmitters can travel from one   neuron to the next neuron and either generate a \nresponse or inhibit a response in the next neuron.   By relying on these mechanisms, neurons \ncan spread signals throughout the brain   in a fraction of a second. (I should point \nout that there are neurons that don’t use   neurotransmitters and rely solely on electrical \nsignals to communicate with one another,   but we won’t focus on them here because they’re \nrelatively rare in the adult nervous system.) OK, so let’s talk a bit about these different \nparts of a neuron. So first, on the right side   of this cell you can see a number of branch-like \nextensions jutting out from a circular structure   that otherwise resembles a typical cell. These \nextensions are called dendrites. The word dendrite   comes from a Greek word that means tree-like, and \nthe name fits because dendrites bear a resemblance   to tree branches. Dendrites are the part of the \nneuron that typically receives messages from   other neurons. To accomplish this, on the surface \nof dendrites are proteins called receptors that   neurotransmitters can interact with. Because \ndendrites are typically where information   in a neuron is received, they can generally \nbe thought of as an input area for the neuron. The part of the neuron that most resembles a \ntypical cell is called the cell body or soma   (and soma is another Greek word that means body). \nThe cell body is the metabolic center of the cell.   It contains the nucleus (which contains the DNA), \nit contains organelles that are involved in doing   things like making proteins, and it’s the site of \nthe synthesis of various other neural components. Sticking out from one side of the \ncell body you can see this little   hill-like area, that’s called the axon hillock.   When information is received at the dendrites, \nit causes changes in the electrical properties   of the cell, and the axon hillock is a \nregion where those changes are integrated   to determine if the incoming signals are \nstrong enough for the neuron to initiate   its own action potential. This process of \nintegrating signals is called summation. If a neuron fires an action potential, the impulse \nwill travel down this structure called the axon   at very rapid speeds ranging from 1 to 100 m/s. \nSo axons act to conduct action potentials. They   vary in size and can range from the order \nof micrometers, or millionths of a meter,   to up to about a meter in humans for the axons \nthat run from the spinal cord to the foot.   Because there are so many neurons in the brain, \nby some estimates if you took all the neurons out   of the brain and laid them end to end, the axons \nwould stretch over 100,000 miles—that’s enough   to wrap around the globe about 4 times. Axons \nare usually (although not always) covered in   a lipid-rich insulatory material called myelin \n(and that's what this purple striped structure   is representing here). Myelin helps to speed up \nthe propagation of electrical signals down the   axon. It prevents the current from leaking out \nof the axon, but also it has these gaps in the   myelin called nodes of Ranvier---that's what \nthis little area is here, a node of Ranvier.   And Ranvier is just the name of the \nscientist who discovered these).   At these gaps are channels that allow positively \ncharged sodium ions to flow into the neuron. This   influx of positively-charged ions helps \nto regenerate the action potential and   move it down the axon (this is something else \nthat I’ll talk about more in another video). At the end of the axon, you see that the structure \nbranches out into endings we call axon terminals   or synaptic boutons.   The word bouton is French for button.   The axon terminals are often situated very close \nto the dendrites of another neuron (although they   can be situated next to any component of \nother neurons), and they communicate with   other neurons at specialized regions called \nsynapses. So this right here is a synapse.   The neurons that communicate at a synapse don't \ntypically come into contact with one another,   but the space separating them is very small: \noften only about 20-40 nanometers wide. I   know a nanometer is not something we can \neasily conceptualize, but for comparison,   a human hair is about 80,000-100,000 nanometers \nwide. So the space between neurons is very, very,   very tiny. That space is called a synaptic \ncleft. The neuron whose axon terminals end   at the synaptic cleft is called the presynaptic \nneuron (and that would be this black neuron here),   while the neuron on the other side of the synaptic \ncleft is called the postsynaptic neuron (that   would be this blue neuron here). When an action \npotential reaches the axon terminal it can cause   chemicals called neurotransmitters to be released \ninto that synaptic cleft. The neurotransmitters   can then bind or attach to receptors on the \npostsynaptic neuron, and either increase or   decrease the likelihood that the postsynaptic \nneuron will fire an action potential of its own. So those are the basic components of a neuron. \nAgain most neurons have those defined regions but   they still often differ from one another in other \nsubstantial ways. We can use those differences to   group neurons into some broad categories. One way \nof categorizing neurons is based on the number of   processes that extend from the cell body. Using \nthis method of classification, there are three   main groups of neurons: multipolar, bipolar, and \nunipolar. Multipolar neurons are the most common   type of neuron in the human nervous system and the \nnervous systems of other vertebrates. Multipolar   neurons usually have a single axon and many \ndendrites. They come in various shapes and sizes.   The length of their axons varies as does the \nextent of their dendritic branching, so they can   still look very different from one another, but \nall of them are modifications on a similar plan. Bipolar neurons have a cell body that gives \nrise to two extensions: one axon and one   dendritic structure. Sensory systems, like the \nvisual system, rely heavily on bipolar neurons. Unipolar neurons have a single extension \nthat has multiple branches, one of which   acts as the axon and others that form dendrites. \nUnipolar neurons are the simplest type of neuron,   and are common in invertebrate nervous systems but \nnot very common in humans and other vertebrates. There are also variants of bipolar neurons \ncalled pseudo-unipolar neurons. These cells   initially form as bipolar neurons, but \nthe dendrite and the axon fuse together   to form a single process that extends from \npart of the cell body. Pseudo-unipolar   neurons carry sensory signals, such as \ninformation about touch to the spinal cord. Neurons can also be classified based on \nfunction. Motor neurons, for example,   are responsible for controlling movement. So they \nhave axons that form synapses with muscles to   cause those muscles to contract. Sensory neurons \ncarry sensory signals back to the spinal cord   and brain. This would include information, \nfor example, about touch, smell, vision,   etc. But the vast majority of neurons in the \nnervous system are considered interneurons,   which are neurons that receive information from \nneurons and then pass it on to other neurons. So   they act as the intermediaries for neurons. \nThese interneurons are also often subdivided   into two types: projection or relay interneurons \nand local interneurons. Projection interneurons   typically have long axons that carry signals \nover long distances, such as from one part of   the brain to another. Local interneurons, on \nthe other hand, form connections with other   neurons nearby. So, they have short axons \nand are involved in creating local circuits. So that is your basic summary \nof neurons. Thanks for watching!"}}