{"6qS83wD29PY": {"video_id": "6qS83wD29PY", "title": "2-Minute Neuroscience: The Neuron", "transcript": "Welcome to 2 minute neuroscience, where I\nsimplistically explain neuroscience topics in 2 minutes or less. In this installment I will discuss the neuron. This is a brain. Estimates vary but right now the best guess\nseems to be that our brains contain around 85 billion neurons. The neuron is a nerve cell and is the primary\nfunctional unit of the nervous system. This is a generic image of a neuron. Neurons actually come in all shapes and sizes\nbut this is the prototypical version of a neuron that you’ll often see in a textbook. The structures extending from the left side\nof a neuron that look a little bit like tree branches are called dendrites. Dendrites are the area where neurons receive\nmost of their information. There are receptors on dendrites that are\ndesigned to pick up signals from other neurons that come in the form of chemicals called\nneurotransmitters. Those signals picked up by dendrites cause\nelectrical changes in a neuron that are interpreted in an area called the soma or the cell body. The soma contains the nucleus, which contains\nthe DNA or genetic material of the cell. The soma takes all the information from the\ndendrites and puts it together in an area called the axon hillock. If the signal coming from the dendrites is\nstrong enough then a signal is sent to the next part of the neuron, which is called the\naxon. At this point the signal is called an action\npotential. The action potential travels down the axon,\nwhich is covered with myelin, an insulatory material that helps to prevent the signal\nfrom degrading. The last step for the action potential is\nthe axon terminals, also known as synaptic buttons. When the signal reaches the axon terminals\nit can cause the release of neurotransmitter. These purple structures represent the dendrites\nof another neuron. When a neurotransmitter is released from axon\nterminals, it interacts with receptors on the dendrites of the next neuron, and then\nthe process repeats with the next neuron."}, "5p9ucgRDie8": {"video_id": "5p9ucgRDie8", "title": "10-Minute Neuroscience: Neurons", "transcript": "Hi everyone, welcome to 10 minute \nneuroscience. In this installment,   I’ll be talking about neurons, the fundamental \nunits of the nervous system. I’ll cover their   basic structure and function and then I’ll \ntalk about some ways we can categorize neurons. Neurons have some unique functions that form the \nbasis for the powerful information processing   capabilities of the nervous system. They’re \nspecialized for transmitting and receiving   information, and they can communicate with one \nanother as well as with cells in other types of   tissues (like muscles or glands). They can also \ncarry information (such as sensory information)   from the rest of the body to the brain. Something \nelse worth noting about neurons is that there are   a lot of them. Current estimates suggest there's \nabout 86 billion neurons in a typical human brain,   and those neurons create a very complex circuitry \nas each neuron forms many connections—usually   thousands of connections—with other neurons. \nThis creates anywhere from hundreds of trillions   to maybe more than a quadrillion areas in a human \nbrain where neurons communicate with one another. So if you look at a neuroscience textbook, \nyou’ll see an image of a neuron that looks   something like this, and this is what we’ll \nuse for our discussion of the neuron today.   But it’s important to note that neurons \ncome in all shapes and sizes—there are   over 1000 different types—and most of them \ndon’t look just like this one–so you can   see here some examples of different types of \nneurons found throughout the nervous system.   They look quite different, but they're all \nvariations on a theme, and most of them have   the same general components—those general \ncomponents are what we’ll focus on today. Before we get into those components let me just \nsay something about how neurons communicate,   because it will make the anatomy we’ll talk about \nnext easier to understand. I’ll have other videos   that cover these topics more in-depth but \nI’ll just provide a quick summary here.   Most neurons use electrical and chemical \nsignals to send messages throughout the   brain. The main type of electrical signals are \ncalled action potentials; they’re created when   charged particles called ions flow into neurons \nand generate an electrical impulse that can travel   from one end of a neuron to another. These \naction potentials can cause the release of   chemical signals called neurotransmitters, \nand neurotransmitters can travel from one   neuron to the next neuron and either generate a \nresponse or inhibit a response in the next neuron.   By relying on these mechanisms, neurons \ncan spread signals throughout the brain   in a fraction of a second. (I should point \nout that there are neurons that don’t use   neurotransmitters and rely solely on electrical \nsignals to communicate with one another,   but we won’t focus on them here because they’re \nrelatively rare in the adult nervous system.) OK, so let’s talk a bit about these different \nparts of a neuron. So first, on the right side   of this cell you can see a number of branch-like \nextensions jutting out from a circular structure   that otherwise resembles a typical cell. These \nextensions are called dendrites. The word dendrite   comes from a Greek word that means tree-like, and \nthe name fits because dendrites bear a resemblance   to tree branches. Dendrites are the part of the \nneuron that typically receives messages from   other neurons. To accomplish this, on the surface \nof dendrites are proteins called receptors that   neurotransmitters can interact with. Because \ndendrites are typically where information   in a neuron is received, they can generally \nbe thought of as an input area for the neuron. The part of the neuron that most resembles a \ntypical cell is called the cell body or soma   (and soma is another Greek word that means body). \nThe cell body is the metabolic center of the cell.   It contains the nucleus (which contains the DNA), \nit contains organelles that are involved in doing   things like making proteins, and it’s the site of \nthe synthesis of various other neural components. Sticking out from one side of the \ncell body you can see this little   hill-like area, that’s called the axon hillock.   When information is received at the dendrites, \nit causes changes in the electrical properties   of the cell, and the axon hillock is a \nregion where those changes are integrated   to determine if the incoming signals are \nstrong enough for the neuron to initiate   its own action potential. This process of \nintegrating signals is called summation. If a neuron fires an action potential, the impulse \nwill travel down this structure called the axon   at very rapid speeds ranging from 1 to 100 m/s. \nSo axons act to conduct action potentials. They   vary in size and can range from the order \nof micrometers, or millionths of a meter,   to up to about a meter in humans for the axons \nthat run from the spinal cord to the foot.   Because there are so many neurons in the brain, \nby some estimates if you took all the neurons out   of the brain and laid them end to end, the axons \nwould stretch over 100,000 miles—that’s enough   to wrap around the globe about 4 times. Axons \nare usually (although not always) covered in   a lipid-rich insulatory material called myelin \n(and that's what this purple striped structure   is representing here). Myelin helps to speed up \nthe propagation of electrical signals down the   axon. It prevents the current from leaking out \nof the axon, but also it has these gaps in the   myelin called nodes of Ranvier---that's what \nthis little area is here, a node of Ranvier.   And Ranvier is just the name of the \nscientist who discovered these).   At these gaps are channels that allow positively \ncharged sodium ions to flow into the neuron. This   influx of positively-charged ions helps \nto regenerate the action potential and   move it down the axon (this is something else \nthat I’ll talk about more in another video). At the end of the axon, you see that the structure \nbranches out into endings we call axon terminals   or synaptic boutons.   The word bouton is French for button.   The axon terminals are often situated very close \nto the dendrites of another neuron (although they   can be situated next to any component of \nother neurons), and they communicate with   other neurons at specialized regions called \nsynapses. So this right here is a synapse.   The neurons that communicate at a synapse don't \ntypically come into contact with one another,   but the space separating them is very small: \noften only about 20-40 nanometers wide. I   know a nanometer is not something we can \neasily conceptualize, but for comparison,   a human hair is about 80,000-100,000 nanometers \nwide. So the space between neurons is very, very,   very tiny. That space is called a synaptic \ncleft. The neuron whose axon terminals end   at the synaptic cleft is called the presynaptic \nneuron (and that would be this black neuron here),   while the neuron on the other side of the synaptic \ncleft is called the postsynaptic neuron (that   would be this blue neuron here). When an action \npotential reaches the axon terminal it can cause   chemicals called neurotransmitters to be released \ninto that synaptic cleft. The neurotransmitters   can then bind or attach to receptors on the \npostsynaptic neuron, and either increase or   decrease the likelihood that the postsynaptic \nneuron will fire an action potential of its own. So those are the basic components of a neuron. \nAgain most neurons have those defined regions but   they still often differ from one another in other \nsubstantial ways. We can use those differences to   group neurons into some broad categories. One way \nof categorizing neurons is based on the number of   processes that extend from the cell body. Using \nthis method of classification, there are three   main groups of neurons: multipolar, bipolar, and \nunipolar. Multipolar neurons are the most common   type of neuron in the human nervous system and the \nnervous systems of other vertebrates. Multipolar   neurons usually have a single axon and many \ndendrites. They come in various shapes and sizes.   The length of their axons varies as does the \nextent of their dendritic branching, so they can   still look very different from one another, but \nall of them are modifications on a similar plan. Bipolar neurons have a cell body that gives \nrise to two extensions: one axon and one   dendritic structure. Sensory systems, like the \nvisual system, rely heavily on bipolar neurons. Unipolar neurons have a single extension \nthat has multiple branches, one of which   acts as the axon and others that form dendrites. \nUnipolar neurons are the simplest type of neuron,   and are common in invertebrate nervous systems but \nnot very common in humans and other vertebrates. There are also variants of bipolar neurons \ncalled pseudo-unipolar neurons. These cells   initially form as bipolar neurons, but \nthe dendrite and the axon fuse together   to form a single process that extends from \npart of the cell body. Pseudo-unipolar   neurons carry sensory signals, such as \ninformation about touch to the spinal cord. Neurons can also be classified based on \nfunction. Motor neurons, for example,   are responsible for controlling movement. So they \nhave axons that form synapses with muscles to   cause those muscles to contract. Sensory neurons \ncarry sensory signals back to the spinal cord   and brain. This would include information, \nfor example, about touch, smell, vision,   etc. But the vast majority of neurons in the \nnervous system are considered interneurons,   which are neurons that receive information from \nneurons and then pass it on to other neurons. So   they act as the intermediaries for neurons. \nThese interneurons are also often subdivided   into two types: projection or relay interneurons \nand local interneurons. Projection interneurons   typically have long axons that carry signals \nover long distances, such as from one part of   the brain to another. Local interneurons, on \nthe other hand, form connections with other   neurons nearby. So, they have short axons \nand are involved in creating local circuits. So that is your basic summary \nof neurons. Thanks for watching!"}, "JGwWNGJdvx8": {"video_id": "JGwWNGJdvx8", "title": "Ed Sheeran - Shape of You (Official Music Video)", "transcript": "[RINGING SOUND] [♪♪♪] ♪ The club isn't the best place\nto find a lover ♪ ♪ So the bar is where I go ♪ ♪ Me and my friends at\nthe table doing shots ♪ ♪ Drinking fast and\nthen we talk slow ♪ ♪ Come over and start up a\nconversation with just me ♪ ♪ And trust me I'll give it\na chance now ♪ ♪ Take my hand, stop, put\nVan the Man on the jukebox ♪ ♪ And then we start to dance,\nand now I'm singing like ♪ ♪ Girl, you know\nI want your love ♪ ♪ Your love was handmade\nfor somebody like me ♪ ♪ Come on now, follow my lead ♪ ♪ I may be crazy,\ndon't mind me ♪ ♪ Say, boy, let's not\ntalk too much ♪ ♪ Grab on my waist and\nput that body on me ♪ ♪ Come on now, follow my lead ♪ ♪ Come, come on now,\nfollow my lead ♪ ♪ I'm in love with\nthe shape of you ♪ ♪ We push and pull\nlike a magnet do ♪ ♪ Although my heart\nis falling too ♪ ♪ I'm in love with your body ♪ ♪ And last night\nyou were in my room ♪ ♪ And now my bedsheets\nsmell like you ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with\nthe shape of you ♪ ♪ One week in\nwe let the story begin ♪ ♪ We're going out on\nour first date ♪ ♪ You and me are thrifty,\nso go all you can eat ♪ ♪ Fill up your bag and\nI fill up a plate ♪ ♪ We talk for hours and hours\nabout the sweet and the sour ♪ ♪ And how your family\nis doing OK ♪ ♪ And leave and get in a taxi,\nthen kiss in the backseat ♪ ♪ Tell the driver make the radio\nplay, and I'm singing like ♪ ♪ Girl, you know\nI want your love ♪ ♪ Your love was handmade\nfor somebody like me ♪ ♪ Come on now, follow my lead ♪ ♪ I may be crazy,\ndon't mind me ♪ ♪ Say, boy, let's not\ntalk too much ♪ ♪ Grab on my waist and\nput that body on me ♪ ♪ Come on now, follow my lead ♪ ♪ Come, come on now,\nfollow my lead ♪ ♪ I'm in love with\nthe shape of you ♪ ♪ We push and pull\nlike a magnet do ♪ ♪ Although my heart\nis falling too ♪ ♪ I'm in love with your body ♪ ♪ And last night you\nwere in my room ♪ ♪ And now my bedsheets\nsmell like you ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ (Oh-I-oh-I-oh-I-oh-I) ♪ ♪ I'm in love with your body ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with\nthe shape of you ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby, come on ♪ ♪ I'm in love with\nthe shape of you ♪ ♪ We push and pull\nlike a magnet do ♪ ♪ Although my heart\nis falling too ♪ ♪ I'm in love with your body ♪ ♪ And last night\nyou were in my room ♪ ♪ And now my bedsheets\nsmell like you ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with your body ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby\n- (I'm in love with your body) ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby\n- (I'm in love with your body) ♪ ♪ Come on, be my baby, come on ♪ ♪ Come on, be my baby\n- (I'm in love with your body) ♪ ♪ Every day discovering\nsomething brand new ♪ ♪ I'm in love with\nthe shape of you ♪ [COSTUME RUSTLES] [HE GROANS]"}, "QVKj3LADCnA": {"video_id": "QVKj3LADCnA", "title": "2. Elimination with Matrices.", "transcript": "2 times this equation, Okay. This is it. The second lecture\nin linear algebra, and I've put below my\nmain topics for today. I put right there a\nsystem of equations that's going to be our\nexample to work with. But what are we\ngoing to do with it? We're going to solve it. And the method of solution\nwill not be determinants. Determinants are something\nthat will come later. The method we'll use\nis called elimination. And it's the way every software\npackage solves equations. And elimination, well, if it\nsucceeds, it gets the answer. And normally it does succeed. If the matrix A that's\ncoming into that system is a good matrix, and\nI think this one is, then elimination will work. We'll get the answer\nin an efficient way. But why don't we, as long\nas we're sort of seeing how elimination works -- it's\nalways good to ask how could it fail? So at the same\ntime, we'll see how elimination decides whether\nthe matrix is a good one or has problems. Then to complete\nthe answer, there's an obvious step of\nback substitution. In fact, the idea\nof elimination is -- you would have\nthought of it, right? I mean Gauss thought\nof it before we did, but only because he\nwas born earlier. It's a natural idea... and died earlier, too. Okay, and you've seen the idea. But now, the part that I want\nto show you is elimination expressed in matrix language,\nbecause the whole course -- all the key ideas get expressed\nas matrix operations, not as words. And one of the operations,\nof course, that we'll meet is how do we multiply\nmatrices and why? Okay, so there's a\nsystem of equations. Three equations\nand three unknowns. And there's the matrix, the\nthree by three matrix -- so this is the system Ax = b. This is our system\nto solve, Ax equal -- and the right-hand side\nis that vector 2, 12, 2. Okay. Now, when I describe\nelimination -- it gets to be a pain to\nkeep writing the equal signs and the pluses and so on. It's that matrix\nthat totally matters. Everything is in that matrix. But behind it is\nthose equations. So what does elimination do? What's the first\nstep of elimination? We accept the first\nequation, it's okay. I'm going to multiply that\nequation by the right number, the right multiplier and\nI'm going to subtract it from the second equation. With what purpose? So that will decide what\nthe multiplier should be. Our purpose is to knock out\nthe x part of equation two. So our purpose is\nto eliminate x. So what do I multiply -- and again, I'll do\nit with this matrix, because I can do it short. What's the multiplier here? What do I multiply --\nequation one and subtract. Notice I'm saying\nthat word subtract. I'd like to stick\nto that convention. I'll do a subtraction. First of all this is the key\nnumber that I'm starting with. And that's called the pivot. I'll put a box around it\nand write its name down. That's the first pivot. The first pivot. Okay. So I'm going to use -- that's sort of like the key\nnumber in that equation. And now what's the multiplier? So I'm going to -- my first row won't change,\nthat's the pivot row. But I'm going to use it -- and now, finally, let me ask\nyou what the multiplier is. Yes? 3 times that first equation\nwill knock out that 3. Okay. So what will it leave? So the multiplier is 3. 3 times that will make that 0. That was our purpose. 3 2s away from the 8 will leave\na 2 and three 1s away from 1 will leave a minus 2. And this guy didn't change. Now the next step -- this is\nforward elimination and that Okay. step's completed. Oh, well, you could say wait\na minute, what about the right hand side? Shall I carry -- the right-hand\nside gets carried along. Actually MatLab finishes up\nwith the left side before -- and then just goes back\nto do the right side. Maybe I'll be MatLab for\na moment and do that. Okay. I'm leaving a room for a column\nof b, the right-hand side. But I'll fill it in later. Okay. Now the next step of\nelimination is what? Well, strictly speaking... this position that I cleaned\nup was like the 2, 1 position, row 2, column 1. So I got a 0 in\nthe 2, 1 position. I'll use 2,1 as the\nindex of that step. The next step should\nbe to finish the column and get a 0 in that position. So the next step is really\nthe 3,1 step, row three, column one. But of course, I already have 0. Okay. So the multiplier is 0. I take 0 of this equation away\nfrom this one and I'm all set. So I won't repeat that, but\nthere was a step there which, MatLab would have to look --\nit would look at this number and, do that step, unless you\ntold it in advance that it was 0. Okay. Now what? Now we can see the second\npivot, which is what? The second pivot --\nsee, we've eliminated -- x is now gone from\nthis equation, right? We're down to two\nequations in y and z. And so now I just do it again. Like, everything's recursive\nat this -- this is like -- such a basic algorithm\nand you've seen it, but carry me through\none last step. So this is still\nthe first pivot. Now the second pivot is this\nguy, who has appeared there. And what's the multiplier, the\nappropriate multiplier now? And what's my purpose? Is it to wipe out the\n3, 2 position, right? This was the 2, 1 step. And now I'm going to\ntake the 3, 2 step. So this all stays the\nsame, 1 2 1, 0 2 -1 and the pivots are there. Now I'm using this pivot,\nso what's the multiplier? this row, gets subtracted from\nthis row and makes that a 0. So it's 0, 0 and is it a 5? Yeah, I guess it's\na 5, is that right? Because I have a\none there and I'm subtracting twice of twice\nthis, so I think it's a 5 there. There's the third pivot. So let me put a box\naround all three pivots. Is there a -- oh, did I\njust invent a negative one? I'm sorry that the tape\ncan't, correct that as easily as I can. Okay. Thank you very much. You get an A in the course now. Is that correct? Is it correct now? Okay. So the three pivots are there -- I know right away a\nlot about this matrix. This elimination step from A --\nthis matrix I'm going to call U. U for upper triangular. So the whole purpose\nof elimination was to get from A to U. And, literally, that's the\nmost common calculation in scientific computing. And people think of how\ncould I do that faster? Because it's a\nmajor, major thing. But we're doing it the\nstraightforward way. We found three pivots, and by\nthe way, I didn't say this, pivots can't be 0. I don't accept 0 as a pivot. And I didn't get 0. So this matrix is great. It gave me three\npivots, I didn't have to do anything special,\nI just followed the rules and, and the pivots are 1, 2 and 5. By the way, just because I\nalways anticipate stuff from a later day, if I wanted to know\nthe determinant of this matrix -- which I never\ndo want to know, but I would just\nmultiply the pivots. The determinant is 10. So even things like the\ndeterminant are here. Okay. Now -- oh, let me talk\nabout failure for a moment, and then -- and then come back to success. How could this have failed? How could -- by fail, I mean\nto come up with three pivots. I mean, there are\na couple of points. I would have already\nbeen in trouble if this very first\nnumber here was 0. If it was a 0 there --\nsuppose that had been a 0, there were no Xs in that\nequation -- first equation. Does that mean I can't\nsolve the problem? Does that mean I quit? No. What do I do? I switch rows. I exchange rows. So in case of a 0, I\nwill not say 0 pivot. I will never be heard to\nutter those words, 0 pivot. But if there's a 0 in\nthe pivot position, maybe I can say\nthat, I would try to exchange for a lower equation\nand get a proper pivot up there. Okay. Now, for example, this\nsecond pivot came out two. Could it have come out 0? What -- actually, if I\nchange that 8 a little bit, I would have got\na little trouble. What should I change that 8\nto so that I run into trouble? A 6. If that had been a 6, then\nthis would have been 0 and I couldn't have\nused that as the pivot. But I could have\nexchanged again. In this case. In this case, because when\ncan I get out of trouble? I can get out of\ntrouble if there's a non-0 below this\ntroublesome 0. And there is here. So I would be okay in this case. If this was a 6, I\nwould survive by a row exchange. Now -- of course, it might have\nhappened that I couldn't do the row, that -- that\nthere was 0s below it, but here there wasn't. Now, I could also have got in\ntrouble if this number 1 was a little different. See, that 1 became a\n5, I guess, by the end. So can you see what\nnumber there would have got me trouble that I\nreally couldn't get out of? Trouble that I\ncouldn't get out of would mean if 0 is\nin the pivot position and I've got no\nplace to exchange. So there must be some number\nwhich if I had had here it would have meant failure. Negative 4, good. If it was a negative 4 here --\nif it happened to be a negative 4, I'll temporarily\nput it up here. If this had been a\nnegative 4 z, then I would have gone\nthrough the same steps. This would have been a minus\n4, it still would have been a minus 4. But at the last minute\nit would have become 0. And there wouldn't have\nbeen a third pivot. The matrix would have\nnot been invertible. Well, of course, the inverse of\na matrix is coming next week, but, you've heard these words before. So, that's how we\nidentify failure. There's temporary failure when\nwe can do a row exchange -- and get out of it, or there's\ncomplete failure when we get a 0 and -- and there's nothing\nbelow that we can use. Okay. Let's stay with -- back to success now. In fact, I guess the next\ntopic is back substitution. So what's back substitution? Well, now I'd better bring\nthe right-hand side in. So what would MatLab do\nand what should we do? Let me bring in the right-hand\nside as an extra column. So there comes B. So it's 2, 12, I would call\nthis the augmented matrix. \"Augment\" means you've\ntacked something on. I've tacked on\nthis extra column. Because, when I'm\nworking with equations, I do the same thing\nto both sides. So, at this step, I subtracted 2\nof the first equation away from the second equation so\nthat this augmented -- I even brought some colored\nchalk, but I don't know if it shows up. So this is like the augmented -- no! Damn, circled the wrong thing. Okay. Here is b. Okay, that's the extra column. Okay. So what happened to\nthat extra column, the right-hand side\nof the equations, when I did the first step? So that was 3 of this away\nfrom this, so it took -- the 2 stayed the same, but\nthree 2s got taken away from 12, leaving 6, and that\n2 stayed the same. So this is how it's\nlooking halfway along. And let me just\ncarry to the end. The 2 and the 6 stay\nthe same, but -- what do I have here? Oh, gosh. Help me out, now. What -- so now I'm -- This is still like\nforward elimination. I got to this point,\nwhich I think is right, and now what did\nI do at this step? I multiplied that pivot by 2\nor that whole equation by 2 and subtracted from\nthat, so I think I take two 6s, which\nis 12, away from the 2. Do you think minus 10 is\nmy final right-hand side -- the right-hand side that\ngoes with U, and let me call that once and\nforever the vector c. So c is what happens to b,\nand U is what happens to A. Okay. There you've seen\nelimination clean. Okay. Oh, what's back substitution? So what are my final\nequations, then? Can I copy these equations? x+2y+z=2 is still there and\n2y-2z=6 is there, and 5z=-10. Okay. Those are the equations\nthat these numbers are telling me about. Those are the\nequations U x equals c. Okay, how do I solve them? What one do I solve for first? z. I see immediately that the\ncorrect value of z is negative And what do I do next? I go back upwards. I now know z here. So, if z is negative 2,\nthat's 4 there, is that right? And so 2 y plus a 4\nis 6, maybe y is 1. Going -- this is\nback substitution. We're doing it on the\nfly because it's so easy. And then x is -- so x -- 2y is 2 minus\n2, maybe x is 2? So you see what back\nsubstitution is. It's the simple step solving\nthe equations in reverse order because the system\nis triangular. Okay. Good. So that's elimination\nand back substitution, and I kept the\nright-hand side along. Okay, now what do I -- that, like, is\nfirst piece of the lecture. What's the second piece? Matrices are going to get in. So I wrote stuff with x, y-s\nand z-s in there, then I really, got the right shorthand, just\nwriting the matrix entries, and now I want to\nwrite the operations that I did in matrices, right? I've carried the\nmatrices along, but I haven't said the operation\nthose elimination steps, I now want to\nexpress as matrices. Okay. Here they come. So now this is\nelimination matrices. Okay. Let me take that first step,\nwhich took me from 1 2 1 3 8 1 0 4 1. I want to operate on that -- I want to do\nelimination on that. Okay. Okay, now I'm\nremembering a point I want to single out as\nespecially important. Let me move the\nboard up for that. Because when we do matrix\noperations, we've got to, like, be able to see the big picture. Okay. Last time, I spoke about\nthe big picture of -- when I multiply a matrix\nby a right-hand side. If I have some matrix there\nand I multiply it by 3 4 5, let's say -- so here's a matrix -- what did I say -- well,\nI guess I only said it on the videotape, but -- do\nyou remember how I look at that matrix multiplication? The result of multiplying\na matrix by some vector is a combination of the\ncolumns of the matrix. It's 3 times the first column. It's 3 times column one plus 4\ntimes column two plus 5 times column three. Okay. I'm going to come back\nto that multiple times. What I wanted to do now was to\nemphasize the parallel thing with rows. Why? Because all our operations\nhere for this two weeks of the course are\nrow operations. So this isn't what I\nneed for row operations. Let me do a row operation. Suppose I have my matrix\nagain and suppose I multiply on the left by some\n-- let's say 1 2 7. Again, I'm just, like,\nsaying what the result is. And then we'll say how\nmatrix multiplication works and we'll see that it's true. Okay. But maybe already I'm making -- I'm sort of bringing up -- the\ncentral idea of linear algebra is how these matrices work by\nrows as well as by columns. Okay. How does it work by rows? What -- so that's a row vector. I could say that's a one\nby three matrix, a row vector multiplying a\nthree by three matrix. What's the output? What's the product of\na row times a matrix? And -- okay, it's a row. A row -- a column -- I'm sorry. A matrix times a\ncolumn is a column. So matrix times a -- yeah. Matrix times a\ncolumn is a column. And we know what column it is. Over here, I'm doing\na row times a matrix. And what's the answer? It's one of that first\nrow, so it's 1 times -- 1 times row one, plus 2 times\nrow two plus 7 times row three. When -- as we do\nmatrix multiplication, keep your eye on what it's\ndoing with whole vectors. And what it's doing -- what\nit's doing in this case is it's combining the rows. And we have a combination, a\nlinear combination of the rows. Okay, I want to use that. Okay, so my question is what's\nthe matrix that does this first step, that takes -- subtracts\n3 of equation one from equation two? That's what I want to do. So this is going to\nbe a matrix that's going to subtract 3 times\nrow one from row two, and leaves the other rows the same. Just in -- I mean, the\nanswer is going to be that. So whatever matrix this is -- and you're going to, like,\ntell me what matrix will do it, it's the matrix that leaves\nthe first row unchanged, leaves the last row unchanged,\nbut takes 3 of these away from this so it puts a 0\nthere, a 2 there and a minus 2. Good. What matrix will do it? It's these. It should be a\npretty simple matrix, because we're doing\na very simple step. We're just doing this\nstep that changes row two. So actually, row\none is not changing. So tell me how the\nmatrix should begin. One -- the first row of\nthe matrix will be 1 0 0, because that's just the right\nthing that takes one of that row and none of the other\nrows, and that's what we want. What's the last\nrow of the matrix? 0 0 1, because that takes\none of the third row and none of the other\nrows, that's great. Okay. Now, suppose I didn't want\nto do anything at all. Suppose my row -- well, I guess\nmaybe I had a case here when I already had a 0 and,\ndidn't have to do anything. What matrix does nothing, like,\njust leaves you where you were? If I put in -- if I put in 0 1 0, that\nwould be -- that would be -- that's the matrix -- what's\nthe name of that matrix? The identity matrix, right. So it does absolutely nothing. It just multiplies everything\nand leaves it where it is. It's like a one, like the\nnumber one, for matrices. But that's not what we want,\nbecause we want to change this row to -- so what's the correct -- what should I put in\nhere now to do it right? I want to get -- what do I want? What I -- I'm after -- I want 3 of row one\nto get subtracted off. So what's the right matrix,\nfinish that matrix for me. Negative 3 goes here? And what goes here? That 1. And what goes here? The 0. That's the good matrix. That's the matrix\nthat takes minus 3 of row one plus the row two\nand gives the new row 2. Should we just, like,\ncheck some particular entry? How do I check a\nparticular entry of a matrix in matrix\nmultiplication? Like, suppose I wanted to check\nthe entry here that's in row two, column three. So where does the entry in row\ntwo, column three come from? I would look at\nrow two of this guy and column three of this\none to get that number. That number comes from the\nsecond row and the third column and I just take this\ndot product minus 3 -- I'm multiplying -- minus 3\nplus 1 and 0 gives the minus 2. Yeah. It works. So we got various ways\nto multiply matrices now. We're sort of,\nlike -- informally. We've got by columns,\nwe've got -- well, we will have by columns,\nby rows, by each entry at a time. But it's good to see that\nmatrix multiplication when one of the matrices is so simple. So this guy is our\nelementary matrix. Let's call it E for\nelementary or elimination. And let me put the indexes 2 1,\nbecause it's the matrix that we needed to fix the 2 1 position. It's the matrix that we\nneeded to get this 2 1 position to be Okay. Good enough. So what do I do next? I need another matrix, right? I need to -- there's another step here. And I want to express\nthe whole elimination process in matrix language. So tell me what -- so next\nstep, step two, which was what? Subtract -- what was -- what\nwas the actual step that we did? I think I subtracted\n-- do you remember? I had a 2 in the pivot\nand a 4 below it, so I subtracted two times -- times row two from row three. From row three. Tell me the matrix\nthat will do that. And tell me its name. Okay, it's going to be E,\nfor elementary or elimination matrix and what's the index\nnumber that I used to tell me what E -- 3, 2, right? Because it's fixing\nthis 3 2 position. And what's the matrix, now? Okay, you remember -- so E 3 2\nis supposed to multiply my guy that I have and it's supposed\nto produce the right result, which was -- it leaves -- it's\nsupposed to leave the first row, it's supposed to leave the\nsecond row and it's supposed to straighten out that\nthird row to this. And what's the matrix\nthat does that? 1 0 0, right? Because we don't change the\nfirst row and the next row we don't change either,\nand the last row is the one we do change. And what do I do? Let's see, I\nsubtract two times -- so what's this row? What's this here? 0, right, because the\nfirst row's not involved. It's just in the 3 2\nposition, isn't it? This the key number is this\nminus the multiplier that goes -- sitting there in\nthat 3 2 position. Is it a minus 2 to subtract 2\nand then this is a 1 so that -- the overall effect is to take\nminus 2 of this row plus 1 of that. Okay. So, I've now given you the\npieces, the elimination matrices, the elementary\nmatrices that take each step. So now what? Now the next point\nin the lecture is to put those steps together\ninto a matrix that does it all and see how it all happens. So now I'm going to\nexpress the whole -- everything we did today so\nfar on A was to start with A, we multiplied it by E 2 1,\nthat was the first step -- and then we multiplied that\nresult by E 3 2 and that led us to this thing and\nwhat was that matrix? U. You see why I like\nmatrix notation, because there in,\nlike, little space -- a few bits when its compressed\non the web -- is everything -- is this whole lecture. Okay. Now there -- there are\nimportant facts about matrix multiplication. And we're close to maybe\nthe most important. And that is this. Suppose I ask you this question. Suppose I start with\na matrix A and I want to end with\na matrix U and I want to say what matrix\ndoes the whole job? What matrix takes me from A to\nU, using the letters I've got? And the answer is simple. I'm not asking this as --\nbut it's highly important. How would I create\nthe matrix that does the whole job\nat once, that does all of elimination in one shot? It would be -- I would just put\nthese together, right? In other words, this is the\nthing I'm struggling to say. I can move those parentheses. If I keep the\nmatrices in order -- I can't mess around with\nthe order of the matrices, but I can change the order\nthat I do the multiplications. I can multiply\nthese two first -- in other words, you see what\nthose parentheses are doing? It's saying -- multiply the\nEs first and that gives you the matrix that does\neverything at once. Okay. So this fact, that this is\nautomatically the same as this -- for every matrix multiplication,\nwhich I'm conscious of still not telling you in\nevery detail, but, like, you're seeing how it works --\nand this is highly important -- and maybe tell me the long\nword that describes this law for matrices, that you\ncan move the parentheses? It's called the associative law. I think you can now forget that. But don't forget the law. I mean, like, forget\nthe word associative. I don't know. But don't forget the law. Because actually, we'll see so\nmany steps in linear algebra, so many proofs,\neven, of main fact come from just moving\nthe parentheses. And it's not that easy to\nprove that this is correct, you have to go into the\ngory details of matrix multiplication, do\nit both ways and see that you come out the same. Maybe I'll leave the\nauthor to do that. Okay. So there we go. So there's a single matrix,\nI could call it E -- while we're talking about these\nmatrices, tell me one other -- there's another type\nof elementary matrix, and we already said\nwhy we might need it. We didn't need it in this case. But it's the matrix\nthat exchanges two rows. It's called a\npermutation matrix. Can you just, like, tell me what\nthat would So I'm just -- like, this is a slight digression\nand be? we'll -- yes, so let me get some -- let me\nfigure out where I'm going to put a permutation matrix. You'll see I'm always\nsqueezing stuff in. So permutation. Or, in fact this one you'll,\nlike, exchange rows -- shall I exchange rows one and\ntwo, just to make life easy? So if I had my matrix -- no, let\n-- let me just do two by two. |a b; c d|. Suppose I want to find\nthe matrix that exchanges those rows. What is it? So the matrix that\nexchanges those rows -- the row I want is\nc d and it's there. So I better take one of it. And the row I want here is up\ntop, so I'll take one of that. So actually, I'm just -- the easy way -- this is my\nmatrix that I'll call P, for permutation. It's the matrix -- actually, the\neasy way to find it is just do the thing to the\nidentity matrix. Exchange the rows of\nthe identity matrix and then that's the matrix that\nwill do row exchanges for you. Suppose I wanted to\nexchange columns instead. Columns have hardly got\ninto today's lecture, but they certainly are\ngoing to be around. How could I -- if I started\nwith this matrix |a b; c d| then I wouldn't -- I'm not even going\nto write this down, I'm just going to ask you,\nbecause in elimination, we're doing rows. But suppose we\nwanted to exchange the columns of a matrix. How would I do that? What matrix multiplication\nwould do that job? Actually, why not? I'll write it down. So this is -- I'll write it under here\nand then hide it again. Okay. Suppose I had my\nmatrix |a b; c d| and I want to get to a c\nover here and b d here. What matrix does that job? Can I multiply -- can I cook up\nsome matrix that produces that answer? You can see from where I\nput my hand I was really asking can I put a matrix\nhere on the left that will exchange columns? And the answer is no. I'm just bringing\nout again this point that when I multiply on the\nleft, I'm doing row operations. So if I want to do\na column operation, where do I put that\npermutation matrix? On the right. If I put it here, where I just\nbarely left room for it -- so I'll exchange the two\ncolumns of the identity. Then it comes out\nright, because now I'm multiplying a column at a time. This is the first column\nand says take one -- take none of that column,\none of this one and then you got it. Over here, take one\nof this one, none of this one and you've got a c. So, in short, to do\ncolumn operations, the matrix multiplies\non the right. To do row operations, it\nmultiplies on the left. Okay, okay, and it's row\noperations that we're really doing. Okay. And of course, I\nmentioned in passing, but I better say it very\nclearly that you can't exchange the orders of matrices. And that's just the point\nI was making again here. A times B is not the\nsame as B times A. You have to keep these matrices\nin their Gauss given order here, right? But you can move\nthe parentheses, so that, in other words,\nthe commutative law, which would allow you to take it\nin the other order is false. So we have to keep\nit in that order. Okay. So what next? I could do this multiplication. I could do E 32. So let me come back\nto see what that was. Here was E 2 1. And here is E 3 2. And if I multiply those\ntwo matrices together -- E 3 2 and then E 2 1,\nI'll get a single matrix that does elimination. I don't want to do it that -- if I do that multiplication -- there -- there's a\nbetter way to do this. And so in this last few\nminutes of today's lecture, can I anticipate\nthat better way? The better way is to think\nnot how do I get from A to U, but how do I get\nfrom U back to A? So reversing steps\nis going to come in. Inverse -- I'll use\nthe word inverse here. Okay. So let me make the first step\nat what's the inverse matrix? All the matrices you've seen\non this board have inverses. I didn't write any\nbad matrices down. We spoke about possible\nfailure, and for a moment, we put in a matrix\nthat would fail. But right now, all\nthese matrices are good, they're all invertible. And let's take the\ninverse -- well, let me say first what does\nthe inverse mean and find it? Okay. So we're getting a little\nleg up on inverses. Okay, so this is the\nfinal moments of today. Sorry, he's still there. Okay. Inverses. Okay, and I'm just going\nto take one example and then we're done. The example I'll take will\nbe that E. So my matrix is 1 0 0 minus 3 1 0 0 0 1. And I want to find the\nmatrix that undoes that step. So what was that step? The step was subtract 3\ntimes row one from row two. So what matrix will get me back? What matrix will bring back -- you know, if I started with a 2\n12 2 and I changed it to a 2 6 2 because of this guy, I want\nto get back to the 2 12 I want to find the matrix which --\nwhich undoes elimination, the matrix which multiplies\nthis to give the identity. And you can tell me what I\nshould do in words first, and then we'll write down\nthe matrix that does it. If this step subtracted\n3 times row 1 from row 2, what's the inverse step? I add 3 times row one\nto row two, right? I add it back. The -- what I subtracted\naway, I add back. So the inverse matrix\nin this case is -- I now want to add 3\ntimes row one to row two, so I won't change row one,\nI won't change row three and I'll add 3 times\nrow one to row two. That's a case where\nthe inverse is clear. It's clear in words what to\ndo, because what this did was simple to express. It just changed row two by\nsubtracting 3 of row one. So to invert it, I go that way. And if you -- if we\ndo that calculation, 3 times this row plus\n1 times this row, comes out the right\nrow of the identity. Okay, so inverses are an -- so if this matrix was E and this\nmatrix is I for identity, then what's the notation\nfor this guy? E to the minus one. E inverse. Okay. Let's stop there for today. That's a little jump on\nwhat's coming on Monday. So, see you Monday."}, "5hO3MrzPa0A": {"video_id": "5hO3MrzPa0A", "title": "Lec 4 | MIT 18.06 Linear Algebra, Spring 2005", "transcript": "Are we ready? Okay, ready for me to start. Ready for the taping\nto start in a minute. He's going to raise his\nhand and signal when I'm on. Just a minute, though, let\nthem settle.0 Okay, guys. Okay, give me the signal,\nthen, when you want me to start. Okay, this is linear\nalgebra, lecture four. And, the first\nthing I have to do is something that was on\nthe list for last time, but here it is now. What's the inverse of a product? If I multiply two\nmatrices together and I know their\ninverses, how do I get the inverse of A times B? So I know what inverses\nmean for a single matrix A and for a matrix B. What matrix do I multiply by to\nget the identity if I have A B? Okay, that'll be\nsimple but so basic. Then I'm going to use that to -- I will have a product of\nmatrices and the product that we'll meet will be\nthese elimination matrices and the net result\nof today's lectures is the big formula\nfor elimination, so the net result\nof today's lecture is this great way to look\nat Gaussian elimination. We know that we get from\nA to U by elimination. We know the steps -- but now\nwe get the right way to look at it, A equals L U. So that's the high\npoint for today. Okay. Can I take the easy part,\nthe first step first? So, suppose A is invertible --\nand of course it's going to be a big question, when is\nthe matrix invertible? But let's say A is invertible\nand B is invertible, then what matrix gives\nme the inverse of A B? So that's the direct question. What's the inverse of A B? Do I multiply those\nseparate inverses? Yes. I multiply the two matrices\nA inverse and B inverse, but what order do I multiply? In reverse order. And you see why. So the right thing to put\nhere is B inverse A inverse. That's the inverse I'm after. We can just check that A B times\nthat matrix gives the identity. Okay. So why -- once again, it's\nthis fact that I can move parentheses around. I can just erase them all and\ndo the multiplications any way I want to. So what's the right\nmultiplication to do first? B times B inverse. This product here\nI is the identity. Then A times the\nidentity is the identity and then finally A times A\ninverse gives the identity. So forgive the dumb\nexample in the book. Why do you, do the inverse\nthings in reverse order? It's just like -- you\ntake off your shoes, you take off your socks, then\nthe good way to invert that process is socks back\non first, then shoes. Sorry, okay. I'm sorry that's on the tape. And, of course, on the other\nside we should really just check -- on the other\nside I have B inverse, A inverse. That does multiply A\nB, and this time it's these guys that\ngive the identity, squeeze down, they give the\nidentity, we're in shape. Okay. So there's the inverse. Good. While we're at it,\nlet me do a transpose, because the next lecture\nhas got a lot to -- involves transposes. So how do I -- if I\ntranspose a matrix, I'm talking about square,\ninvertible matrices right now. If I transpose one,\nwhat's its inverse? Well, the nice formula is -- let's see. Let me start from A, A\ninverse equal the identity. So -- give me a first row. And let me transpose both sides. That will bring a\ntranspose into the picture. So if I transpose the identity\nmatrix, what do I have? The identity, right? If I exchange rows and\ncolumns, the identity is a symmetric matrix. It doesn't know the difference. If I transpose these guys,\nthat product, then again it turns out that I have\nto reverse the order. I can transpose them\nseparately, but when I multiply, those transposes come\nin the opposite order. So it's A inverse\ntranspose times A transpose giving the identity. So that's -- this equation is\n-- just comes directly from that one. But this equation tells\nme what I wanted to know, namely what is the inverse\nof this guy A transpose? What's the inverse of that\n-- if I transpose a matrix, what'ss the inverse\nof the result? And this equation tells\nme that here it is. This is the inverse\nof A transpose. Inverse of A transpose. Of A transpose. So I'll put a big\ncircle around that, because that's the\nanswer, that's the best answer we could hope for. That if you want to know\nthe inverse of A transpose and you know the inverse of A,\nthen you just transpose that. So in a -- to put\nit another way, transposing and inversing\nyou can do in either order for a single matrix. Okay. So these are like basic\nfacts that we can now use, all right -- so now\nI put it to use. I put it to use by thinking\n-- we're really completing, the subject of elimination. Actually, -- the thing about\nelimination is it's the right way to understand what\nthe matrix has got. This A equal L U is the\nmost basic factorization of a matrix. I always worry\nthat you will think this course is all elimination. It's just row operations. And please don't. We'll be beyond that, but it's\nthe right algebra to do first. Okay. So, now I'm coming\nnear the end of it, but I want to get\nit in a decent form. So my decent form\nis matrix form. I have a matrix A, let's\nsuppose it's a good matrix, I can do elimination,\nno row exchanges -- So no row exchanges for now. Pivots all fine, nothing\nzero in the pivot position. I get to the very\nend, which is U. So I get from A to U. And I want to know\nwhat's the connection? STUDENT: Zero one zero? How is A related to U? And this is going to\ntell me that there's a matrix L that connects them. Okay. Can I do it for a\ntwo by two first? Okay. Two by two, elimination. Okay, so I'll do it under here. Okay. So let my matrix A be -- We'll keep it simple,\nsay two and an eight, so we know that the\nfirst pivot is a two, and the multiplier's\ngoing to be a four and then let me put a\none here and what number do I not want to put there? Four. I don't want a four there,\nbecause in that case, the second pivot would not --\nwe wouldn't have a second pivot. The matrix would be\nsingular, general screw-up. Okay. So let me put some other\nnumber here like seven. Okay. Okay. Now I want to operate on that\nwith my elementary matrix. So what's the elementary matrix? Strictly speaking,\nit's E21, because it's the guy that's going to produce\na zero in that position. And it's going to\nproduce U in one shot, because it's just a\ntwo by two matrix. So two one and I'm going to take\nfour of those away from those, produce that zero and\nleave a three there. And that's U. And what's the\nmatrix that did it? Quick review, then. What's the elimination\nelementary matrix E21 -- it's one zero, thanks. And -- negative four one, right. Good. Okay. So that -- you see the\ndifference between this and what I'm shooting for. I'm shooting for A on one\nside and the other matrices on the other side\nof the equation. Okay. So I can do that right away. Now here's going to\nbe my A equals L U. And you won't have any\ntrouble telling me what -- so A is still two\none eight seven. L is what you're going to\ntell me and U is still two one zero three. Okay. So what's L in this case? Well, first -- so how is\nL related to this E guy? It's the inverse, because\nI want to multiply through by the inverse of this, which\nwill put the identity here, and the inverse will show\nup there and I'll call it L. So what is the inverse of this? Remember those elimination\nmatrices are easy to invert. The inverse matrix for this one\nis 1 0 4 1, it's actually flip STRANG: Zero one zero. sign. Okay. Do you want -- if we did the numbers\nright, we must -- this should be correct. Okay. And of course it is. That says the first row's\nright, four times the first row plus the second\nrow is eight seven. Good. That's simple, two by two. Okay. But it already shows the\nform that we're headed for. It shows -- so what's\nthe L stand for? Why the letter L? If U stood for upper\ntriangular, then of course L stands for lower triangular. And actually, it has ones on the\ndiagonal, where this thing has the pivots on the diagonal. Oh, sometimes we may want\nto separate out the pivots, so can I just mention that\nsometimes we could also write this as -- we could have this\none zero four one -- I'll just show you how I\nwould divide out this matrix of pivots -- two three. There's a diagonal matrix. And I just -- whatever\nis left is here. Now what's left? If I divide this first row\nby two to pull out the two, then I have a one\nand a one half. And if I divide the second row\nby three to pull out the three, then I have a one. Where shall we put\nthem?4 So if this is L U, this is maybe called\nL D or pivot U. And now it's a\nlittle more balanced, because we have ones on\nthe diagonal here and here. And the diagonal\nmatrix in the middle. So both of those... Matlab would produce either one. I'll basically stay with L U. Okay. Now I have to think about\nbigger than two by two. But right now, this was\njust like easy exercise. And, to tell the truth,\nthis one was a minus sign and this one was a plus sign. I mean, that's the\nonly difference. But, with three\nby three, there's a more significant difference. Let me show you how that works. Let me move up to\na three by three, let's say some matrix A, okay? Let's imagine it's\nthree by three. I won't write\nnumbers down for now. So what's the first\nelimination step that I do, the first\nmatrix I multiply it by, what letter will I use for that? It'll be E two one,\nbecause it's -- the first step will be to get a\nzero in that two one position. right? Okay, now a second row -- say\nzero zero one and the third guy And then the next step will be\nto get a zero in the three one position. And the final step will be to\nget a zero in the three two That's what elimination is,\nand it produced U. position. And again, no row exchanges. I'm taking the nice case,\nnow, the typical case, too -- when I don't have to\ndo any row exchange, all I do is these\nelimination steps. Okay. Now, suppose I want that stuff\nover on the right-hand side, as I really do. That's, like, my point here. I can multiply these\ntogether to get a matrix E, but I want it over on the right. I want its inverse over there. So what's the right\nexpression now? If I write A and\nU, what goes there? So I've got the inverse of\nthis, I've got three matrices in Okay. a row now. And it's their\ninverses that are going to show up, because each\none is easy to invert. Question is, what\nabout the whole bunch? How easy is it to\ninvert the whole bunch? So, that's what\nwe know how to do. We know how to invert, we should\ntake the separate inverses, but they go in the\nopposite order. So what goes here? E three two inverse,\nright, because I'll multiply from the left\nby E three two inverse, then I'll pop it up next to U. And then will come\nE three one inverse. And then this'll be\nthe only guy left standing and that's gone when\nIdo an E two one inverse. So there is L. That's L U. L is product of inverses. Now you still can ask why is\nthis guy preferring inverses? And let me explain why. Let me explain why is this\nproduct nicer than this one? This product turns out to\nbe better than this one. Let me take a typical case here. Let me take a typical case. So let me -- I have to do three by three\nfor you to see the improvement. Two by two, it was\njust one E, no problem. But let me go up to this case. Suppose my matrices E21 -- suppose E21 has a\nminus two in there. Suppose that -- and\nnow suppose -- oh, I'll even suppose\nE31 is the identity. I'm going to make the point\nwith just a couple of these. Okay. Now this guy will have\n-- do something -- now let's suppose\nminus five one. Okay. There's typical. That's a typical case in\nwhich we didn't need an E31. Maybe we already had a zero\nin that three one position. Okay. Let me see -- is that going to\nbe enough to, show my point? Let me do that multiplication. So if I do that multiplication\nit's like good practice to Okay. multiply these matrices. Tell me what's above\nthe diagonal when I do this multiplication? All zeroes. When I do this\nmultiplication, I'm going to get ones on the\ndiagonal and zeroes above. Because -- what does that say? That says that I'm subtracting\nrows from lower rows. So nothing is\nmoving upwards as it did last time in Gauss-Jordan. Okay. Now -- so really, what I have to\ndo is check this minus two one zero, now this is --\nwhat's that number? This is the number that\nI'm really have in mind. That number is ten. And this one is -- what goes here? Row three against column two,\nit looks like the minus five. It's that ten. How did that ten get in there? I don't like that ten. I mean -- of course, I\ndon't want to erase it, because it's right. But I don't want it there. It's because -- the ten got in\nthere because I subtracted two of row one from row two, and\nthen I subtracted five of that new row two from row three. So doing it in that order, how\ndid row one effect row three? Well, it did, because two of\nit got removed from row two and then five of those got\nremoved from row three. So altogether ten of row one\ngot thrown into row three. Now my point is in the\nreverse direction -- so now I can do it -- below\nit I'll do the inverses. Okay. And, of course, opposite order. Reverse order. Reverse order. Okay. So now this is going to -- this\nis the E that goes on the left side. Left of A. Now I'm going to do the\ninverses in the opposite order, so what's the -- So the opposite order means\nI put this inverse first. And what is its inverse? What's the inverse of E21? Same thing with a\nplus sign, right? For the individual matrices,\ninstead of taking away two I add back two of row one\nto row two, so no problem. And now, in reverse order,\nI want to invert that. Just right? I'm doing just this, this. So now the inverse is\nagain the same thing, but add in the five. And now I'll do\nthat multiplication and I'll get a happy result. I hope. Did I do it right so far? Yes, okay. Let me do the multiplication. I believe this comes out. So row one of the\nanswer is one zero zero. Oh, I know that all this\nis going to be left, right? Then I have two one zero. So I get two one\nzero there, right? And what's the third row? What's the third\nrow in this product? Just read it out to\nme, the third row? And this is my matrix L. And it's the one that\ngoes on the left of U. It goes into --\nwhat do I mean here? Maybe rather than saying\nleft of A, left of U, let me right down\nagain what I mean. E A is U, whereas A is L U. Okay. Let me make the\npoint now in words. The order that the matrices\ncome for L is the right order. The two and the\nfive don't sort of interfere to produce\nthis ten one zero zero. in the right order,\nthe multipliers just sit in the matrix L. That's the point -- that\nif I want to know L, I have no work to do. I just keep a record of\nwhat those multipliers were, and that gives me L. So I'll draw the\n-- let me say it. So this is the A=L U. So if no row exchanges, the\nmultipliers that those numbers that we multiplied\nrows by and subtracted, when we did an\nelimination step -- the multipliers go\ndirectly into L. Okay. So L is -- this is the way,\nto look at elimination. You go through the\nelimination steps, and actually if you\ndo it right, you can throw away A\nas you create L U. If you think about it,\nthose steps of elimination, as when you've finished\nwith row two of A, you've created a new row two\nof U, which you have to save, and you've created the\nmultipliers that you used -- So that is like a cycle.\nwhich you have to save, and then you can forget A. So because it's all\nthere in L and U. So that's -- this moment\nis maybe the new insight in elimination that\ncomes from matrix -- doing it in matrix form. So it was -- the\nproduct of Es is -- we can't see what\nthat product of Es is. The matrix E is not a\nparticularly attractive one. What's great is when we put\nthem on the other side -- their inverses in\nthe opposite order, there the L comes\nout just right. Now -- oh gosh, so\ntoday's a sort of, Okay. like, practical day. Can we think together how\nexpensive is elimination? How many operations do we do? So this is now a kind of new\ntopic which I didn't list as -- on the program,\nbut here it came. How many operations\non an n by n matrix A. I mean, it's a very\npractical question. Can we solve systems of\norder a thousand, in a second or a minute or a week? Can we solve systems of order a\nmillion in a second or an hour or a week? I mean, what's the -- if it's n by n, we often\nwant to take n bigger. I mean, we've put\nin more information. We make the whole thing is more\naccurate for the bigger matrix. But it's more expensive,\ntoo, and the question is how much more expensive? If I have matrices\nof order a hundred. Let's say a hundred\nby a hundred. Let me take n to be a hundred. Say n equal a hundred. How many steps are we doing? How many operations are we\nactually doing that we -- And let's suppose there aren't\nany zeroes, because of course if a matrix has got a lot\nof zeroes in good places, we don't have to do\nthose operations, and, it'll be much faster. It's going to move -- it's\ngoing to change all rows, But -- so just think for a\nmoment about the first step. So here's our matrix A,\nhundred by a hundred. And the first step will be -- that column, is got zeroes down here. So it's down to 99 by 99, right? That's really like the\nfirst stage of elimination, That puts row two\nmoves up to row one, row three moves up to\nto get from this hundred by hundred non-zero\nmatrix to this stage where the first pivot is sitting\nup here and the first row's okay the first column is okay. So, eventually -- how\nmany steps did that take? You see, I'm trying\nto get an idea. Is the answer proportional to n? Is the total number of steps in\nelimination, the total number, is it proportional to n -- in\nwhich case if I double n from a hundred to two hundred --\ndoes it take me twice as long? Does it square, so it would\ntake me four times as long? Does it cube so it would\ntake me eight times as long? Or is it n factorial, so it\nwould take me a hundred times as long? I think, you know, from a\npractical point of view, we have to have some\nidea of the cost, here. So these are the\nquestions that I'm -- let me ask those\nquestions again. Is it proportional -- does\nit go like N, like N squared, like N cubed -- or\nsome higher power of N? Like N factorial where every\nstep up multiplies by a hundred and then by a hundred and one\nand then by a hundred and two -- which is it? Okay, so that's\nthe only way I know to answer that is to think\nthrough what we actually had to do. Okay. So what was the cost here? Well, let's see. What do I mean by an operation? I guess I mean, well\nan addition or -- yeah. No big deal. I guess I mean an\naddition or a subtraction or a multiplication\nor a division. Okay. And actually, what operation\nI doing all the time? When I multiply row one\nby multiplier L and I subtract from row six. What's happening\nthere individually? What's going on? If I multiply -- I do a multiplication by\nL and then a subtraction. So I guess operation -- Can I count that for the\nmoment as, like, one operation? Or you may want to\ncount them separately. The typical operation is\nmultiply plus a subtract. So if I count those together,\nmy answer's going to come out What's that? half as many as if -- I mean, if I count\nthem separately, I'd have a certain\nnumber of multiplies, certain number of subtracts. That's really want to do. How many have I got here? Okay. So, I think -- let's see. It's about -- well,\nhow many, roughly? How many operations to\nget from here to here? Well, maybe one\nway to look at it is all these numbers\nhad to get changed. The first row\ndidn't get changed, but all the other rows\ngot changed at this step. So this step -- well,\nI guess maybe -- shall I say it cost\nabout a hundred squared. I mean, if I had\nchanged the first row, then it would have been exactly\nhundred squared, because -- because that's how\nmany numbers are here. A hundred squared numbers is\nthe total count of the entry, and all but this insignificant\nfirst row got changed. So I would say about\na hundred squared. Okay. Now, what about the next step? So now the first row is fine. The second row is fine. And I'm changing these\nzeroes are all fine, so what's up with\nthe second step? And then you're with me. Roughly, what's the cost? If this first step\ncost a hundred squared, about, operations\nthen this one, which is really working on this guy to\nproduce this, costs about what? How many operations to fix? About ninety-nine squared, or\nninety-nine times ninety-eight. But less, right? Less, because our\nproblem's getting smaller. About ninety-nine squared. And then I go down and down\nand the next one will be ninety-eight squared, the\nnext ninety-seven squared and finally I'm down\naround one squared or -- where it's just like\nthe little numbers. The big numbers are here. So the number of operations\nis about n squared plus that was n, right? n was a hundred? n squared for the first step,\nthen n minus one squared, then n minus two squared,\nfinally down to three squared and two squared and\neven one squared. No way I should\nhave written that -- squeezed that in. Let me try it so the count\nis N squared plus N minus one squared plus -- all the\nway down to one squared. That's a pretty decent count. Admittedly, we didn't catch\nevery single tiny operation, but we got the right\nleading term here. And what do those add up to? Okay, so now we're coming\nto the punch of this, question, this operation count. So the operations on the\nleft side, on the matrix A to finally get to U. And anybody -- so which of\nthese quantities is the right ballpark for that count? If I add a hundred squared to\nninety nine squared to ninety eight squared --\nninety seven squared, all the way down to two\nsquared then one squared, what have I got, about? It's just one of these --\nlet's identify it first. Is it N? Certainly not. Is it n factorial? No. If it was n\nfactorial, we would -- with determinants,\nit is n factorial. I'll put in a bad mark against\ndeterminants, because that -- okay, so what is it? It's n -- well,\nthis is the answer. It's this order -- n cubed. It's like I have n terms, right? I've got n terms in this sum. And the biggest\none is N squared. So the worst it could\nbe would be n cubed, but it's not as bad as -- it's N cubed times -- it's about one third of n cubed. That's the magic\noperation count. Somehow that one third\ntakes account of the fact that the numbers\nare getting smaller. If they weren't\ngetting smaller, we would have n terms\ntimes n squared, but it would be exactly n cubed. But our numbers are getting\nsmaller -- actually, row two and row one\nmoves down to row three. do you remember where does\none third come in this -- I'll even allow a\nmention of calculus. So calculus can be\nmentioned, integration can be mentioned now in the next\nminute and not again for weeks. It's not that I don't like\n18.01, but18.06 is better. Okay. So, -- so what's -- what's the\ncalculus formula that looks like? It looks like -- if we were\nin calculus instead of summing stuff, we would integrate. So I would integrate x squared\nand I would get one third x cubed. So if that was like an\nintegral from one to N, of x squared b x, if the answer\nwould be one third n cubed -- and it's correct for the sum\nalso, because that's, like, the whole point of calculus. The whole point of\ncalculus is -- oh, I don't want to tell\nyou the whole -- I mean, you know the\nwhole point of calculus. Calculus is like sums\nexcept it's continuous. Okay. And algebra is discreet. Okay. So the answer is\none third n cubed. Now I'll just -- let me say one\nmore thing about operations. What about the right-hand side? This was what it cost\non the left side. This is on A. Because this is A that\nwe're working with. But what's the cost on\nthe extra column vector b that we're hanging around here? So b costs a lot\nless, obviously, because it's just one column. We carry it through\nelimination and then actually we do\nback substitution. Let me just tell you\nthe answer there. It's n squared. So the cost for every right\nhand side is n squared. So let me -- I'll just fit that in here --\nfor the the cost of b turns out to be n squared. So you see if we\nhave, as we often have, a a matrix A and\nseveral right-hand sides, then we pay the price on A,\nthe higher price on A to get it split up into L and U\nto do elimination on A, but then we can process every\nright-hand side at low cost. Okay. So the -- We really have\ndiscussed the most fundamental algorithm for a\nsystem of equations. Okay. So, I'm ready to\nallow row exchanges. I'm ready to allow -- now\nwhat happens to this whole -- today's lecture if\nthere are row exchanges? When would there\nbe row exchanges? There are row -- we need to do\nrow exchanges if a zero shows up in the pivot position. So moving then into the final\nsection of this chapter, which is about\ntransposes -- well, we've already seen\nsome transposes, and -- the title of this section is, So tell -- there is\nanother one here. \"Transposes and Permutations.\" Okay. So can I say, now, where\ndoes a permutation come in? Let me talk a little\nabout permutations. So that'll be up\nhere, permutations. So these are the matrices that\nI need to do row exchanges. And I may have to do\ntwo row exchanges. Can you invent a\nmatrix where I would have to do two row exchanges\nand then would come out fine? Yeah let's just, for\nthe heck of it -- so I'll put it here. Let me do three by threes. Actually, why don't\nI just plain list all the three by three\npermutation matrices. There're a nice\nlittle group of them. What are all the matrices\nthat exchange no rows at all? Well, I'll include the identity. So that's a permutation matrix\nthat doesn't do anything. Now what's the permutation\nmatrix that exchanges -- what is P12? The permutation matrix that\nexchanges rows one and two would be -- 0 1 0 -- 1 0 0, right. I just exchanged those rows of\nthe identity and I've got it. Okay. Actually, I'll -- yes. Let me clutter this up. Okay. Give me a complete list of\nall the row exchange matrices. So what are they? They're all the ways I can\ntake the identity matrix and rearrange its rows. How many will there be? How many three by three\npermutation matrices? Shall we keep going\nand get the answer? So tell me some more. What one are you\ngoing to do now? I'm going to switch\nrows one and -- One and three, okay. One and three,\nleaving two alone. Now what else? Okay. Switch -- what would\nbe the next easy one -- is switch two and three, good. So I'll leave one zero zero\nalone and I'll switch -- I'll move number three\nup and number two down. Okay. Those are the ones that just\nexchange single -- a pair of rows. This guy, this guy and this\nguy exchanges a pair of rows, but now there are\nmore possibilities. What's left? And there's one\nmore, which is -- let's see. What's left? I'm lost. STUDENT: Is it zero zero one? STRANG: Okay. STUDENT: One zero zero. STRANG: One zero zero, okay. Zero one zero. Okay. Great. Six. Six of them. Six P. And they're sort\nof nice, because what happens if I write, multiply\ntwo of them together? If I multiply two of\nthese matrices together, what can you tell\nme about the answer? It's on the list. If I do some row\nexchanges and then I do some more row exchanges,\nthen all together I've done row exchanges. So if I multiply --\nbut, I don't know. And if I invert, then I'm\njust doing row exchanges to get back again. So the inverses are all there. It's a little family\nof matrices that -- they've got their\nown -- if I multiply, I'm still inside this group. If I invert I'm inside\nthis group -- actually, group is the right\nname for this subject. It's a group of six matrices,\nand what about the inverses? What's the inverse of\nthis guy, for example? What's the inverse -- if I\nexchange rows one and two, what's the inverse matrix? Just tell me fast. The inverse of that matrix is -- if I exchange rows\none and two, then what I should do to get\nback to where I started is the same thing. So this thing is\nits own inverse. That's probably its own inverse. This is probably\nnot -- actually, I think these are\ninverses of each other. Oh, yeah, actually -- the inverse is the transpose. There's a curious fact\nabout permutations matrices, that the inverses\nare the transposes. And final moment -- how\nmany are there if I -- how many four by\nfour permutations? So let me take four by four -- how many Ps? Well, okay. Make a good guess. Twenty four, right. Twenty four Ps. Okay. So, we've got these\npermutation matrices, and in the next\nlecture, we'll use them."}}